{
  "meta": {
    "curriculum": "Zambia",
    "grade": "10",
    "subject": "Agricultural Science",
    "philosophy": "Quality, life-long education for all which is accessible, inclusive and relevant to individual, national and global needs and value systems.",
    "competence_learning": "The syllabus has been reviewed in line with the Outcome Based Education principles which seek to link education to real life experiences that give learners skills to access, criticize analyze and practically apply knowledge that help them gain life skills. Its competences and general outcomes are the expected outcomes to be attained by the leaners through the acquisition of knowledge, skills, techniques and values which are very important for the total development of the individual and the nation as a whole. Effective implementation of Outcome Based Education requires that the following principles be observed: clarity of focus, Reflective designing, setting high expectations for all learners and appropriate opportunities.\nThrough this syllabus the learners are required to acquire knowledge, values and develop positive attitudes and skills. These enable learners to: Use and handle Agricultural Science apparatus and materials correctly; Handle specimens correctly and carefully; Draw specimens, apparatus and substances accurately; Clean apparatus correctly; Stores apparatus, tools and substances correctly and safely.",
    "goals": [
      "promotes an appreciation of Agricultural Science as an applied science;",
      "demonstrates the value of Agriculture to the family and the community, so as to show that improved Agriculture can contribute to the World-wide Campaign for freedom from hunger;",
      "encourages the teaching, in a practical manner, of basic principles and skills in Agriculture and of efficient farm business management.",
      "stimulate an interest in, and create an awareness of, existing problems and opportunities in farming;",
      "develops initiative, problem-solving abilities, scientific methods and self-education so as to encourage resourcefulness and self-reliance;",
      "provides a basis, together with the basic Sciences and Mathematics, for more advanced studies in Agriculture or for becoming a self-supporting worker;",
      "stimulating positive attitudes by showing that efficient farming can be both a profitable and rewarding occupation; and",
      "develops positive attitudes towards Zambia's natural resources so as to conserve and use them sustainably."
    ]
  },
  "topics": [
    {
      "unit": "10.1",
      "topic_title": "AGRICULTURE IN ZAMBIA",
      "page_number": 18,
      "subtopics": [
        "Importance of Agriculture",
        "Importance of the Farmer"
      ],
      "specific_outcomes": [
        "State the importance of agriculture.",
        "Classify agriculture as an applied science or as a technology.",
        "Explain why the knowledge and skills of people trained in agriculture are needed.",
        "Explain the importance of a farmer in a nation."
      ]
    },
    {
      "unit": "10.1",
      "topic_title": "AGRICULTURE IN ZAMBIA",
      "page_number": 19,
      "subtopics": [
        "Environmental Influences of Agriculture."
      ],
      "specific_outcomes": [
        "Explain the Agro-ecological zones of Zambia.",
        "State the duration of rainfall in Zambia.",
        "Describe the annual rainfall for each of the Agro-ecological zones of Zambia.",
        "Describe the mean annual temperatures of the three Agro-ecological zones in Zambia.",
        "Explain the importance of day length to crop growth.",
        "Classify crops according to day length.",
        "State rainfall and temperature requirements of crops."
      ]
    },
    {
      "unit": "10.2",
      "topic_title": "SOIL SCIENCE",
      "page_number": 20,
      "subtopics": [
        "Types of rocks and minerals.",
        "Soil Formation and Weathering"
      ],
      "specific_outcomes": [
        "Identify different types of rocks.",
        "List some minerals found in different rocks.",
        "Describe soil formation from parent rocks.",
        "Explain the effects of weathering."
      ]
    },
    {
      "unit": "10.3",
      "topic_title": "CROP PRODUCTION",
      "page_number": 21,
      "subtopics": [
        "Crop Plants",
        "External and Internal Morphology Plants.",
        "The Flower and Pollination"
      ],
      "specific_outcomes": [
        "Identify different types of crop",
        "Describe the external and internal morphology of plants.",
        "Relate the structure of the parts of the crop to their functions.",
        "Describe the functions of parts of a flower.",
        "Identify parts of a seed.",
        "Explain the advantages and disadvantages of using hybrid seeds."
      ]
    },
    {
      "unit": "10.3",
      "topic_title": "CROP PRODUCTION",
      "page_number": 22,
      "subtopics": [
        "Vegetative Propagation",
        "Distribution of Crops"
      ],
      "specific_outcomes": [
        "Describe different methods of vegetative propagation.",
        "Demonstrate vegetative propagation of different crops.",
        "Explain the difficulties limiting the growing of certain crops in some parts of Zambia.",
        "Compare the climatic requirements of various Crops.",
        "Describe the characteristics of soil suitable for the production of crops.",
        "Explain the factors affecting crop growth.",
        "Grow the crops studied."
      ]
    },
    {
      "unit": "10.3",
      "topic_title": "CROP PRODUCTION",
      "page_number": 23,
      "subtopics": [
        "Seed Planting",
        "Fertiliser application"
      ],
      "specific_outcomes": [
        "Describe the process of land preparation for crop production.",
        "Identify conditions necessary for germination of seeds.",
        "Prepare seedbeds suitable for germination of seeds.",
        "Practice planting for the crop studied",
        "Practice crop rotation.",
        "Describe the different methods of applying fertilisers for crops studied",
        "Calculate the quantity of fertiliser for crops studied.",
        "State the particular types of fertilisers recommended for crops.",
        "Explain the effect of fertiliser on the environment.",
        "Explain how to minimise negative effects of fertilisers on the environment."
      ]
    },
    {
      "unit": "10.3",
      "topic_title": "CROP PRODUCTION",
      "page_number": 24,
      "subtopics": [
        "Weed control",
        "Pests and Diseases of Crops"
      ],
      "specific_outcomes": [
        "Identify various methods of weed control in the crops studied.",
        "Describe ways in which different chemicals control weeds in the crops studied.",
        "State the advantages and disadvantages of using herbicides and mechanical weed control.",
        "Identify the negative effects of herbicides on the environment.",
        "Explain how to minimise negative effects of herbicides on the environment.",
        "State the characteristics of common pests of crops.",
        "Identify signs of pest attack in crops.",
        "Identify signs of disease attack on crops."
      ]
    },
    {
      "unit": "10.3",
      "topic_title": "CROP PRODUCTION",
      "page_number": 25,
      "subtopics": [
        "Prevention and Control of Pests on Crops.",
        "Harvesting"
      ],
      "specific_outcomes": [
        "Describe the life cycle of one insect that carries crop/plant diseases.",
        "Describe various methods of preventing and controlling pests and diseases on crops.",
        "State advantages and disadvantages of biological pest control.",
        "Identify crops that are ready for harvesting.",
        "Harvesting the crop studied correctly.",
        "Describe various methods of storing the crop studied."
      ]
    },
    {
      "unit": "10.4",
      "topic_title": "FORESTRY",
      "page_number": 26,
      "subtopics": [
        "Trees",
        "Uses of wood",
        "Agro-forestry"
      ],
      "specific_outcomes": [
        "Describe forestry",
        "Identify the role played by trees in the environment",
        "State the different uses of wood.",
        "Explain the meaning of agro-forestry.",
        "Identify various tree species that will improve soil fertility.",
        "Plant appropriate trees to improve soil fertility and reduce soil erosion.",
        "State the advantages and disadvantages of Agro-forestry."
      ]
    },
    {
      "unit": "10.5",
      "topic_title": "CONSERVATION FARMING",
      "page_number": 27,
      "subtopics": [
        "Organic farming and Soil Fertility",
        "Organic and Conventional methods of farming"
      ],
      "specific_outcomes": [
        "Describe organic farming.",
        "Explain the role of organic farming in soil fertility.",
        "Explain the meaning of term organic matter.",
        "Explain the importance of maintaining or increasing organic matter for crops.",
        "Describe conventional farming methods.",
        "Explain the importance of organic methods of farming."
      ]
    },
    {
      "unit": "10.5",
      "topic_title": "CONSERVATION FARMING",
      "page_number": 28,
      "subtopics": [
        "Conservation Farming and Crop Rotation",
        "Intercropping"
      ],
      "specific_outcomes": [
        "Investigate what successful conservation farming methods can achieve.",
        "Explain when conservation methods of farming should be used.",
        "Describe the meaning of crop rotation.",
        "Explain why crop rotation is important.",
        "Explain the importance of including legumes in crop rotation.",
        "Explain the importance of Intercropping crops.",
        "Explain what a farmer considers when Intercropping crops.",
        "Demonstrate intercropping of crops."
      ]
    },
    {
      "unit": "10.5",
      "topic_title": "CONSERVATION FARMING",
      "page_number": 29,
      "subtopics": [
        "Conservation Tillage",
        "Green Manure"
      ],
      "specific_outcomes": [
        "Explain the meaning of conservation tillage.",
        "Explain the benefits of no tillage or conservation tillage.",
        "State the meaning of Green manure.",
        "Explain the importance of green manure.",
        "Use green manure to grow Crops."
      ]
    },
    {
      "unit": "10.6",
      "topic_title": "LIVESTOCK PRODUCTION",
      "page_number": 30,
      "subtopics": [
        "Economic Importance of Livestock",
        "Anatomy and Physiology of Livestock"
      ],
      "specific_outcomes": [
        "State the economic importance of the types of livestock studied.",
        "Explain digestion in a ruminant, non ruminant and bird.",
        "Describe the structural function of the circulatory system of animals.",
        "Describe the storage of energy in animal bodies.",
        "Explain the energy release and utilisation in the body of animals.",
        "Identify breeding cycles of various farm animals.",
        "Describe the characteristics of breeds of farm animals studied.",
        "Explain the criteria used for selecting breeding animals.",
        "Explain the importance of cross breeding and in breeding in livestock production.",
        "Describe the process of artificial insemination."
      ]
    },
    {
      "unit": "10.6",
      "topic_title": "LIVESTOCK PRODUCTION",
      "page_number": 31,
      "subtopics": [
        "Anatomy and Physiology of Livestock",
        "Health in livestock"
      ],
      "specific_outcomes": [
        "State the advantages and disadvantages of Artificial Insemination in livestock production.",
        "Describe development of the foetus.",
        "Describe the structure and functions of mammary glands.",
        "Explain the process of milk let-down and milk hold-up in lactating animals.",
        "Identify signs of good and poor health in livestock.",
        "Describe the nutritive value of livestock feed.",
        "Determine the presence of various types of nutrients in animal feeds."
      ]
    },
    {
      "unit": "10.6",
      "topic_title": "LIVESTOCK PRODUCTION",
      "page_number": 32,
      "subtopics": [
        "Nutritional Deficiencies",
        "Pests of Livestock",
        "Diseases"
      ],
      "specific_outcomes": [
        "Identify symptoms of nutritional deficiencies in livestock studied.",
        "Identify suitable species of pasture for livestock production in Zambia.",
        "State sustainable utilisation of pastures and the consequences of overgrazing.",
        "Explain the effects of pests on livestock.",
        "Describe the life cycles of ecto-parasite and endo parasite of farm animals",
        "Investigate methods of preventing and controlling pests of farm animals studied.",
        "Identify methods of preventing and controlling diseases of animals."
      ]
    },
    {
      "unit": "10.6",
      "topic_title": "LIVESTOCK PRODUCTION",
      "page_number": 33,
      "subtopics": [
        "Housing and Marketing"
      ],
      "specific_outcomes": [
        "Explain the suitability and maintenance of various types of livestock housing.",
        "Describe the preparation of livestock and livestock products for marketing.",
        "Identify organisations in Zambia that process and market livestock products."
      ]
    },
    {
      "unit": "10.7",
      "topic_title": "FARM STRUCTURES",
      "page_number": 33,
      "subtopics": [
        "Farm Buildings"
      ],
      "specific_outcomes": [
        "Select a site for farm buildings.",
        "Prepare a simple plan for a farm building.",
        "Describe different farm structures.",
        "Construct an improved farm structure using local materials.",
        "Explain the importance of maintaining farm structures."
      ]
    },
    {
      "unit": "10.8",
      "topic_title": "FARM MACHINERY",
      "page_number": 34,
      "subtopics": [
        "Work and Power",
        "Levers, Pulleys and Screws",
        "Maintenance of Farm Implements."
      ],
      "specific_outcomes": [
        "Describe when a machine is doing work on a farm.",
        "Explain the meaning of horse power.",
        "Explain the importance of knowledge of horse power on a farm.",
        "Explain the use of various tools on the farm.",
        "Calculate velocity ratio and mechanical advantage.",
        "Identify the main parts of mould-board plough, cultivator, harrow, planter and ridger",
        "Demonstrate understanding and practical application of centre of gravity.",
        "Demonstrate the maintenance of farm implements."
      ]
    },
    {
      "unit": "10.9",
      "topic_title": "FARM MANAGEMENT",
      "page_number": 35,
      "subtopics": [
        "Factors of production",
        "Marketing of Agricultural Products"
      ],
      "specific_outcomes": [
        "State factors of production in agriculture.",
        "Suggest ways of improving production.",
        "Explain the law of diminishing returns.",
        "Explain the law of supply and demand.",
        "Explain the effects of controlling prices of agricultural inputs and products on demand and supply.",
        "Suggest ways of increasing sales of agricultural products in the local area.",
        "Describe the effect of production distribution on marketing of farm produce.",
        "Explain the effects of agricultural marketing policies on the development of agriculture.",
        "Identify advantages and disadvantages of liberalising marketing of agricultural input and products."
      ]
    }
  ]
}