{
  "meta": {
    "curriculum": "Zambia",
    "grade": "12",
    "subject": "Agricultural Science",
    "philosophy": "Quality, life-long education for all which is accessible, inclusive and relevant to individual, national and global needs and value systems. The syllabus has been reviewed in line with Outcome Based Education principles which seek to link education to real life experiences that give learners skills to access, criticize analyze and practically apply knowledge that help them gain life skills.",
    "competence_learning": "Learners are expected to demonstrate the ability to practice animal husbandry by rearing pigs, goats and fish; practice crop husbandry by growing tubers and oil seeds; practice conservation farming; and demonstrate understanding of the mechanism of a four-stroke internal petrol engine.",
    "goals": [
      "Demonstrate an understanding of Agriculture in Zambia.",
      "Develop investigative skills.",
      "Recognise the importance of soil management for sustainable crop production.",
      "Develop knowledge of crops and their sustainable production.",
      "Demonstrate knowledge and understanding of the importance of plants and the need for their sustainable utilisation.",
      "Develop knowledge and understanding of conservation farming.",
      "Develop knowledge of livestock and their production.",
      "Acquire knowledge of farm structures and maintenance.",
      "Acquire knowledge of farm machinery and maintenance.",
      "Acquire knowledge and understanding of farm management."
    ]
  },
  "topics": [
    {
      "unit": "12.1",
      "topic_title": "AGRICULTURE IN ZAMBIA",
      "page_number": 51,
      "subtopics": [
        "12.1.1 Modern Agriculture",
        "12.1.2 Farmer Experiments"
      ],
      "specific_outcomes": [
        "12.1.1.1 Identify various enterprises farmers engage in on a farm.",
        "12.1.1.2 Explain the advantages of having several enterprises on the farm",
        "12.1.1.3 Explain the harm agriculture can cause to the environment.",
        "12.1.2.1 Explain why farmers should carryout experiment with new and own technologies.",
        "12.1.2.2 Explain how farmer experiments can be improved.",
        "12.1.2.3 State the importance of disseminating farmer experimental results."
      ]
    },
    {
      "unit": "12.2",
      "topic_title": "SOIL SCIENCE",
      "page_number": 52,
      "subtopics": [
        "12.2.1 Soil and Water",
        "12.2.2 Soil Fertility",
        "12.2.3 Soil Acidity and Alkalinity"
      ],
      "specific_outcomes": [
        "12.2.1.1 Determine the capillarity of given soil samples.",
        "12.2.1.2 Determine the drainage rates of given soil samples.",
        "12.2.1.3 Explain different types of soil moisture and their significance to crop production.",
        "12.2.2.1 Identify factors that determine the fertility of soil.",
        "12.2.2.2 Describe the role of the nitrogen cycle in soil fertility.",
        "12.2.2.3 Describe the role of the carbon cycle in soil fertility.",
        "12.2.2.4 Describe maintenance of soil fertility.",
        "12.2.2.5 Describe improvement of soil fertility.",
        "12.2.2.6 Determine radicals and minerals contained in a sample of fertiliser.",
        "12.2.3.1 Explain the uses of acids, bases and salts in agriculture.",
        "12.2.3.2 Explain the effects of acids, bases and salts on crop and soil organisms.",
        "12.2.3.3 State effects of excessive use of fertilisers.",
        "12.2.3.4 Describe the neutralisation of soil acids.",
        "12.2.3.5 Apply lime to a piece of land."
      ]
    },
    {
      "unit": "12.3",
      "topic_title": "CROP PRODUCTION",
      "page_number": 54,
      "subtopics": [
        "12.3.1 Site for a crop",
        "12.3.2 Seedbeds Preparation and Sowing/planting",
        "12.3.3 Fertiliser Application",
        "12.3.4 Weed Control",
        "12.3.5 Pests and Diseases of Crops",
        "12.3.6 Prevention and Control of Pests and Diseases on Crops",
        "12.3.7 Harvesting",
        "12.3.8 Storage",
        "12.3.9 Irrigation"
      ],
      "specific_outcomes": [
        "12.3.1.1 Clear the site for growing a crop studied",
        "12.3.2.1 Describe the process of land preparation for crop production.",
        "12.3.2.2 State the disadvantages and advantages of various forms of land preparation.",
        "12.3.2.3 Prepare seedbeds suitable for germination of seeds.",
        "12.3.2.4 Practice sowing/ planting of crops studied.",
        "12.3.3.1 Describe the different methods of applying fertiliser for the crops studied.",
        "12.3.3.2 Calculate the quantity of fertilisers recommended for the crops studied.",
        "12.3.3.3 Explain why particular types of fertilisers are recommended for the crops studied.",
        "12.3.4.1 State various methods of weed control in the crops studied.",
        "12.3.4.2 Describe ways in which different chemicals control weeds in the crops studied.",
        "12.3.5.1 State the characteristics of common pests of crops.",
        "12.3.5.2 Describe symptoms of common diseases of crops.",
        "12.3.5.3 Identify pests that attack crops.",
        "12.3.6.1 Describe various methods of preventing and controlling pests and diseases on crops.",
        "12.3.6.2 Carryout preventive measures of pests and diseases on crops studied.",
        "12.3.7.1 Identify crops that are ready for harvesting.",
        "12.3.7.2 Harvest the crop correctly.",
        "12.3.8.1 Describe various methods of storing crops studied.",
        "12.3.8.2 Explain the advantages and disadvantages of various methods of crop storage",
        "12.3.9.1 Explain the need for irrigation.",
        "12.3.9.2 Describe the different methods of irrigating crops.",
        "12.3.9.3 Suggest suitable methods of irrigation on a given piece of landscape.",
        "12.3.9.4 Identify the effects of irrigation on the environment.",
        "12.3.9.5 Explain reduction of salinity.",
        "12.3.9.6 Explain the significance of the water cycle and ground water resources."
      ]
    },
    {
      "unit": "12.4",
      "topic_title": "FORESTRY",
      "page_number": 57,
      "subtopics": [
        "12.4.1 Site for trees",
        "12.4.2 Establishment and Management of Trees",
        "12.4.3 Improved Fallow"
      ],
      "specific_outcomes": [
        "12.4.1.1 Choose a site suitable for growing trees.",
        "12.4.1.2 Prepare a site for growing trees.",
        "12.4.2.1 Establish and manage an indigenous and exotic tree nursery.",
        "12.4.2.2 State the management of a woodlot.",
        "12.4.3.1 Distinguish between fallow and improved fallow."
      ]
    },
    {
      "unit": "12.5",
      "topic_title": "CONSERVATION AGRICULTURE",
      "page_number": 58,
      "subtopics": [
        "12.5.1 Importance of Conservation Agriculture",
        "12.5.2 Agricultural Techniques",
        "12.5.3 Organic Matter in the Soil",
        "12.5.4 Conservation Practices",
        "12.5.5 Aeration of Soil"
      ],
      "specific_outcomes": [
        "12.5.1.1 Describe conservation agriculture.",
        "12.5.1.2 Explain the importance of conservation agriculture.",
        "12.5.1.3 Explain the importance of soil factors that are recognised in conservation agriculture",
        "12.5.2.1 Describe how sustainable agriculture can provide adequate nutrient availability in the soil.",
        "12.5.3.1 Explain the importance of organic matter in the soil.",
        "12.5.3.2 Explain how organic matter is reduced in the soil.",
        "12.5.3.3 State ways to increase organic matter in the soil.",
        "12.5.4.1 Describe how clearing plants from the field damages the soil.",
        "12.5.4.2 Plan for deep and shallow rooted crops.",
        "12.5.4.3 Explain how cropping practices can encourage water retention in the soil.",
        "12.5.4.4 Practice cropping systems that encourage water to remain in the soil.",
        "12.5.4.5 Explain why it is important to maintain a high cover on soil throughout the dry rain season.",
        "12.5.4.6 Maintain a high cover on soil throughout the dry and rain season.",
        "12.5.5.1 Explain the importance of aeration.",
        "12.5.5.2 Describe how to improve soil aeration in a field."
      ]
    },
    {
      "unit": "12.6",
      "topic_title": "LIVESTOCK PRODUCTION",
      "page_number": 60,
      "subtopics": [
        "12.6.1 Importance of Livestock",
        "12.6.2 Health in Livestock",
        "12.6.3 Livestock Feed",
        "12.6.4 Nutritional Deficiencies",
        "12.6.4 Pests and Diseases of Livestock",
        "12.6.5 Housing",
        "12.6.6 Livestock Marketing",
        "12.6.7 Types of Fish in Zambia",
        "12.6.8 Methods of Fish Farming in Zambia",
        "12.6.9 Fish Pond",
        "12.6.10 Fish Marketing"
      ],
      "specific_outcomes": [
        "12.6.1 State the economic importance of types of livestock studied.",
        "12.6.2.1 Identify signs of good and poor health in livestock.",
        "12.6.3.1 Describe the nutritive value of the livestock feed for the animals studied.",
        "12.6.4.1 Describe symptoms of nutritional deficiencies in livestock studied.",
        "12.6.4.2 Identify suitable species of pasture for livestock studied.",
        "12.6.4.1 State the effect of pests on livestock.",
        "12.6.4.2 Describe methods of preventing and controlling pests that attack farm animals studied.",
        "12.6.4.3 Describe methods of preventing and controlling diseases on animals.",
        "12.6.5.1 State the suitability and maintenance of various types of livestock housing.",
        "12.6.6.1 Describe the preparation of livestock and livestock products for marketing.",
        "12.6.6.2 Identify organisations in Zambia that process and market the livestock products.",
        "12.6.7.1 Identify common types of fish found in Zambia.",
        "12.6.7.2 Describe the foodstuffs for fish.",
        "12.6.8.1 Identify common methods of fish farming in Zambia.",
        "12.6.8.3 State advantages and disadvantages of integrated fish farming.",
        "12.6.9.1 Establish and manage fish pond.",
        "12.6.9.2 Describe different ways of harvesting fish.",
        "12.6.10.1 Prepare and market fish."
      ]
    },
    {
      "unit": "12.7",
      "topic_title": "FARM STRUCTURES",
      "page_number": 63,
      "subtopics": [
        "12.7.1 Structures for Water Supply",
        "12.7.2 Pollution of Water Supplies"
      ],
      "specific_outcomes": [
        "12.7.1.1 Describe different structures for water supply.",
        "12.7.1.2 Describe methods of maintaining named water supply system.",
        "12.7.2.1 Describe water pollution.",
        "12.7.2.2 Describe ways in which water supplies on the farm may be polluted.",
        "12.7.2.3 Describe ways of preventing and controlling pollution of water supplies on the farm."
      ]
    },
    {
      "unit": "12.8",
      "topic_title": "FARM MACHINERY",
      "page_number": 64,
      "subtopics": [
        "12.8.1 Engines",
        "12.8.2 Maintenance of Engines",
        "12.8.3 Farm Mechanisation"
      ],
      "specific_outcomes": [
        "12.8.1.1 Identify the parts of an engine and the function.",
        "12.8.1.2 Explain the working of the two and the four stroke internal petrol engines.",
        "12.8.1.3 Explain the differences between petrol and diesel engines.",
        "12.8.2.1 Describe maintenance of the main system of an engine.",
        "12.8.2.2 State the lubrication system of a four stroke petrol engine.",
        "12.8.2.3 Describe the electrical system of a petrol engine.",
        "12.8.2.4 Describe the water and air cooling system of engine.",
        "12.8.3.1 Explain the advantages and disadvantages of farm mechanisation."
      ]
    },
    {
      "unit": "12.9",
      "topic_title": "FARM MANAGEMENT",
      "page_number": 65,
      "subtopics": [
        "12.9.1 Farm Valuation",
        "12.9.2 Insurance",
        "12.9.3 Cooperatives",
        "12.9.4 Entrepreneurship"
      ],
      "specific_outcomes": [
        "12.9.1.1 Prepare an inventory of assets on the farm.",
        "12.9.1.2 Prepare an opening and closing valuation on a farm.",
        "12.9.1.3 Describe the various methods of calculating depreciation of farm machinery.",
        "12.9.2.1 Explain the difference between risks and uncertainties.",
        "12.9.2.2 State the importance of insurance policies in agriculture.",
        "12.9.2.3 Describe various types of insurance in agriculture.",
        "12.9.3.1 Describe how cooperatives are organised.",
        "12.9.3.2 Explain the common interest of farmers in a cooperative.",
        "12.9.4.1 Describe different kinds of agricultural enterprises",
        "12.9.4.2 Explain what makes an agricultural enterprise successful.",
        "12.9.4.3 Explain why market research is important.",
        "12.9.4.4 Explain how to cost and price a product."
      ]
    }
  ]
}