{
  "meta": {
    "curriculum": "Zambia",
    "grade": "11",
    "subject": "Agricultural Science",
    "philosophy": "Quality, life-long education for all which is accessible, inclusive and relevant to individual, national and global needs and value systems.",
    "competence_learning": "Demonstrate the ability to handle and use farm implements and equipment. Demonstrate the ability to Fence an area on the farm. Demonstrate the ability to practice animal husbandry by raring chickens and cattle. Demonstrate the ability to grow, manage and market vegetables and fruits.",
    "goals": [
      "Demonstrate an understanding of Agriculture in Zambia.",
      "Develop investigative skills",
      "Recognise the importance of soil management for sustainable crop production.",
      "Develop knowledge of crops and their sustainable production.",
      "Demonstrate knowledge and understanding of the forest and the need for their sustainable utilisation.",
      "Develop knowledge of crops and understanding of conservation farming.",
      "Develop knowledge of livestock and their production.",
      "Acquire knowledge of farm structures and maintenance.",
      "Acquire knowledge of farm machinery and maintenance.",
      "Acquire knowledge and understanding of farm management."
    ]
  },
  "topics": [
    {
      "unit": "11.1",
      "topic_title": "AGRICULTURE IN ZAMBIA",
      "page_number": 37,
      "subtopics": [
        "11.1.1 Land use",
        "11.1.2 Development of Agriculture"
      ],
      "specific_outcomes": [
        "11.1.1.1 Explain ways in which some factors limit the use of land in different areas of Zambia.",
        "11.1.1.2 Describe different forms of land use, including different agricultural systems and farming practices",
        "11.1.1.3 State land classification.",
        "11.1.2.1 Explain some factors that affect agricultural development in a nation.",
        "11.1.2.2 Explain the effects of land tenure on agriculture"
      ]
    },
    {
      "unit": "11.2",
      "topic_title": "SOIL SCIENCE",
      "page_number": 38,
      "subtopics": [
        "11.2.1 Soil Profiles and Classification",
        "11.2.2 Composition and Properties of Soil"
      ],
      "specific_outcomes": [
        "11.2.1.1 Compare and contrast the various layers of a soil profile in the school garden.",
        "11.2.1.2 Explain the importance of a soil profile.",
        "11.2.1.3 Classify soil samples",
        "11.2.2.1 Determine the constituents of soil.",
        "11.2.2.2 Explain the importance of constituents of soil.",
        "11.2.2.3 Determine physical and chemical characteristics of different soils."
      ]
    },
    {
      "unit": "11.3",
      "topic_title": "CROP PRODUCTION",
      "page_number": 39,
      "subtopics": [
        "11.3.1 Site for a Crop",
        "11.3.2 Seedbed Preparation and Sowing/Planting",
        "11.3.3 Fertiliser Application",
        "11.3.4 Weed Control",
        "11.3.5 Pests and Diseases of Crops",
        "11.3.6 Prevention and Control of Pests and Diseases on Crops",
        "11.3.7 Harvesting",
        "11.3.8 Storage"
      ],
      "specific_outcomes": [
        "11.3.1.1 Prepare a site for growing a crop studied.",
        "11.3.2.1 Describe the process of land preparation for crop rotation.",
        "11.3.2.2 State the advantages and disadvantages of various forms of land preparation.",
        "11.3.2.3 Prepare seedbeds suitable for germination of seeds.",
        "11.3.2.4 Practice sowing/planting of crops studied.",
        "11.3.3.1 Describe the different methods of applying fertilisers for the crops studied.",
        "11.3.3.2 Calculate the quantity of fertiliser for the crop studied.",
        "11.3.3.3 Explain why particular types of fertiliser are recommended for the crop studied.",
        "11.3.4.1 State various methods of weed control in the crops studied.",
        "11.3.4.2 Describe ways in which different chemicals control weeds in the crops studied.",
        "11.3.5.1 State the characteristics of common pests of crops.",
        "11.3.14 Describe symptoms of common diseases of crops studied",
        "11.3.15 Identify crops that have been attacked by diseases.",
        "11.3.6.1 Describe various methods of preventing and controlling pests and diseases on crops.",
        "11.3.6.2 Carry out preventive measures of pests on crops studied.",
        "11.3.7.1 Identify crops that are ready for harvesting.",
        "11.3.7.2 Harvest the crop studied correctly.",
        "11.3.8.1 Describe various methods of storing crops studied.",
        "11.3.8.2 Explain the advantages and disadvantages of various methods of crop storage."
      ]
    },
    {
      "unit": "11.4",
      "topic_title": "FORESTRY",
      "page_number": 41,
      "subtopics": [
        "11.4.1 Deforestation",
        "11.4.2 Measures to Control Deforestation"
      ],
      "specific_outcomes": [
        "11.4.1.1 Identify causes of deforestation.",
        "11.4.1.2 State effects of deforestation.",
        "11.4.2.1 Formulate measures of preventing and controlling of deforestation."
      ]
    },
    {
      "unit": "11.5",
      "topic_title": "CONSERVATION FARMING",
      "page_number": 42,
      "subtopics": [
        "11.5.1 Organic Matter and Fertiliser",
        "11.5.2 Compost",
        "11.5.3 Animal Manure",
        "11.5.4 Soil Preparation",
        "11.5.5 Pests and Diseases",
        "11.5.6 Role of Crop Rotation in Pest and Disease Control",
        "11.5.7 Cropping Systems and Pests and Disease Control",
        "11.5.8 Barriers and Traps for Pests",
        "11.5.9 Timing of Planting"
      ],
      "specific_outcomes": [
        "11.5.1.1 State the advantages and disadvantages of using organic matter and artificial fertiliser to supply nutrients to crops.",
        "11.5.2.1 Investigate the importance of compost to a crop.",
        "11.5.2.2 Prepare a compost heap.",
        "11.5.3.1 Explain the importance of using animal manure.",
        "11.5.3.2 Identify the crop nutrients provided by various types of animal manure.",
        "11.5.3.3 Describe the harvesting, handling and storage of animal manure.",
        "11.5.4.1 Prepare soil for growing a crop under organic farming",
        "11.5.5.1 Prepare appropriate natural pesticides to control pests.",
        "11.5.6.1 Explain the role of crop rotation in preventing pests and diseases in organic production.",
        "11.5.7.1 Describe companion planting.",
        "11.5.7.2 Demonstrate companion planting when growing crops.",
        "11.5.7.3 Use plants to attract predators and parasites.",
        "11.5.8.1 Use barriers and traps to control crop pests.",
        "11.5.9.1 Explain the importance of timing of planting in the reduction of pest attack."
      ]
    },
    {
      "unit": "11.6",
      "topic_title": "LIVESTOCK PRODUCTION",
      "page_number": 44,
      "subtopics": [
        "11.6.1 Importance of Livestock",
        "11.6.2 Health in Livestock",
        "11.6.3 Livestock Feed",
        "11.6.4 Nutritional Deficiencies",
        "11.6.5 Pests of Livestock",
        "11.6.6 Diseases",
        "11.6.7 Housing",
        "11.6.8 Marketing",
        "11.6.9 Bee Farming",
        "11.6.10 Fish Marketing"
      ],
      "specific_outcomes": [
        "11.6.1.1 State the economic importance of the types of livestock studied.",
        "11.6.2.1 Identify signs of good and poor health in livestock.",
        "11.6.3.1 Describe the nutritive value of the livestock feed for the animals studied.",
        "11.6.4.1 Describe symptoms of nutritional deficiencies in livestock studied.",
        "11.6.4.2 Identify suitable species of pasture for livestock studied.",
        "11.6.5.1 State the effects of pests on livestock.",
        "11.6.5.2 Investigate methods of preventing and controlling pests that attack animals studied.",
        "11.6.6.1 State methods of preventing and controlling diseases on animals studied.",
        "11.6.7.1 Describe the suitability and maintenance of various types of livestock housing.",
        "11.6.8.1 Describe the preparation of livestock and livestock products for marketing.",
        "11.6.8.2 Identify organisations in Zambia that process and market the livestock products.",
        "11.6.9.1 Describe common methods of bee farming.",
        "11.6.9.2 Construct a framed bee hive.",
        "11.6.9.3 Establish and manage an apiary.",
        "11.6.9.4 State methods of harvesting honey.",
        "11.6.9.5 Process and grade honey and honey products for marketing.",
        "11.6.10.1 Prepare and market fish."
      ]
    },
    {
      "unit": "11.7",
      "topic_title": "FARM STRUCTURES",
      "page_number": 47,
      "subtopics": [
        "11.7.1 Fencing",
        "11.7.2 Hedges",
        "11.7.3 Green Houses"
      ],
      "specific_outcomes": [
        "11.7.1.1 Describe the different types and uses of fences.",
        "11.7.1.2 Fence an area on the farm.",
        "11.7.1.3 Explain advantages and disadvantages of fences on a farm.",
        "11.7.2.1 Explain uses of hedges.",
        "11.7.2.2 Establish and maintain a hedge.",
        "11.7.2.3 State advantages and disadvantages of hedges on a farm.",
        "11.7.3.1 Describe a green house.",
        "11.7.3.2 Explain the advantages and disadvantages of a green house",
        "11.7.3.3 Make a green house.."
      ]
    },
    {
      "unit": "11.8",
      "topic_title": "MACHINERY",
      "page_number": 48,
      "subtopics": [
        "11.8.1 Friction",
        "11.8.2 Rusting"
      ],
      "specific_outcomes": [
        "11.8.1.1 State the meaning of machine.",
        "11.8.1.2 Explain the effects of friction on farm machinery.",
        "11.8.1.3 State ways of increasing and overcoming friction.",
        "11.8.2.1 Identify conditions that encourage rusting.",
        "11.8.2.2 Explain what happens during rusting.",
        "11.8.2.3 Prevent rusting on farm machines."
      ]
    },
    {
      "unit": "11.9",
      "topic_title": "FARM MANAGEMENT",
      "page_number": 49,
      "subtopics": [
        "11.9.1 Budgeting",
        "11.9.2 Costing and Accounting"
      ],
      "specific_outcomes": [
        "11.9.1.1 Explain budgeting",
        "11.9.1.2 Prepare a budget for an enterprise.",
        "11.9.1.3 Prepare a cash flow budget for an enterprise.",
        "11.9.2.1 Distinguish between direct enterprise costs and overhead costs.",
        "11.9.2.2 State factors that determine prices of commodities.",
        "11.9.2.3 Calculate gross margins of an enterprise.",
        "11.9.2.4 Suggest ways of increasing gross margin of an enterprise.",
        "11.9.2.5 Calculate profit of an enterprise."
      ]
    }
  ]
}