{
  "meta": {
    "curriculum": "Zambia",
    "grade": "5",
    "subject": "Expressive Arts",
    "philosophy": "Quality, lifelong education for all which is accessible, inclusive and relevant to individual, national and global needs and value systems. The Expressive Arts (EA) Syllabus reflects a learning area where the following subjects have been integrated: Physical Education, Music, Art and Design. This learning area emphasises on developing creativity, analysis, problem-solving, and investigations in learners. Expressive Arts provides opportunities for the individual and the group to learn activities that are invigorating, developmental and educational which in turn lead to appreciation of cultural heritage, positive physical, social, mental and emotional growth. In particular, EA helps to cultivate healthy habits, the spirit of team work, determination and resolve. Expressive Art studies enables learners to participate in musical composition and performance, visual arts, sports and games both for leisure and competition and as a means of livelihood. The purpose of this syllabus is to give an equal opportunity to learners who are abled and differently-abled to develop to their highest potential and an opportunity to acquire life skills. Expressive Arts plays an important role in the development of learners. It provides an avenue for learners to express themselves through movement, physical activity, and creative application of modern scientific and technological knowledge for survival skills. Learners develop a variety of life skills, awareness and sense of appreciation for the social, cultural as well as economic value of our natural environment.",
    "competence_learning": "The syllabus has been reviewed in line with the Outcomes Based Education Principles which seek to link education to real life experiences that give learners skills to access, criticise, analyse and practically apply knowledge that help them gain life skills. Its competences and general outcomes are the expected outcomes to be attained by the leaners through the acquisition of knowledge, skills, techniques and values which are very important for the total development of the individual and the nation as a whole. Effective implementation of Outcomes Based Education requires that the following principles be observed: clarity of focus, reflective designing, setting high expectations for all learners and appropriate opportunities.",
    "goals": [
      "Develop skills to improve neuromuscular coordination through participation in a variety of activities in order to improve fitness, manipulation, coordination, correlation, imagination, observation and self-expression.",
      "Acquire knowledge, skills, and values, positive attitudes to enhance creativity, self-expression and aesthetic sense.",
      "Acquire knowledge and values on safety and health",
      "Develop skills in maintaining safety and health",
      "Acquire knowledge, skills, positive attitudes and values in fundamental movement",
      "Acquire knowledge, skills, values and positive attitudes to perform various sports activities, music, games and dance dance to improve physical fitness",
      "Develop crafts skills in making artefacts",
      "Acquire knowledge, values and swimming skills",
      "Develop basic swimming skills"
    ]
  },
  "topics": [
    {
      "unit": "5.1",
      "topic_title": "SAFETY AND HEALTH",
      "page_number": 13,
      "subtopics": [
        "5.1.1 Safety"
      ],
      "specific_outcomes": [
        "Explain the importance of appropriate dress in practical activities",
        "Perform activities to show how inappropriate dress can affect performance in practical activities",
        "Demonstrate general safety",
        "Design posters and visual signs for safety notification"
      ]
    },
    {
      "unit": "5.2",
      "topic_title": "MOVEMENT",
      "page_number": 13,
      "subtopics": [
        "5.2.1 Movement"
      ],
      "specific_outcomes": [
        "Perform movement patterns for specific sports"
      ]
    },
    {
      "unit": "5.3",
      "topic_title": "DRAWING AND COLOURING",
      "page_number": 13,
      "subtopics": [
        "5.3.1 Imaginative Composition",
        "5.3.2 Figure Drawing"
      ],
      "specific_outcomes": [
        "Draw and colour pictures based on imagination",
        "Draw and colour figures in action",
        "Draw and colour portraits."
      ]
    },
    {
      "unit": "5.4",
      "topic_title": "NOTATION",
      "page_number": 14,
      "subtopics": [
        "5.4.1 Musical Notes"
      ],
      "specific_outcomes": [
        "Identify musical notes",
        "Recite and compose musical notes",
        "Draw musical notes"
      ]
    },
    {
      "unit": "5.5",
      "topic_title": "ZAMBIAN MUSIC",
      "page_number": 14,
      "subtopics": [
        "5.5.1 Harmony",
        "5.5.2 Style and Form"
      ],
      "specific_outcomes": [
        "Sing songs with harmonies",
        "Describe the form and style of Zambian music"
      ]
    },
    {
      "unit": "5.6",
      "topic_title": "EDUCATIONAL GYMNASTICS",
      "page_number": 14,
      "subtopics": [
        "5.6.1 Tumbling",
        "5.6.2 Stunts"
      ],
      "specific_outcomes": [
        "Perform a series of tumbling activities",
        "Perform floor and balancing activities"
      ]
    },
    {
      "unit": "5.7",
      "topic_title": "HEALTH AND FITNESS MANAGEMENT",
      "page_number": 14,
      "subtopics": [
        "5.7.1 Health",
        "5.7.2 Fitness"
      ],
      "specific_outcomes": [
        "Perform a series of physical activities with obstacles",
        "Perform a series of developmental activities",
        "Demonstrate isometric activities"
      ]
    },
    {
      "unit": "5.8",
      "topic_title": "SPORTS SKILLS DEVELOPMENT",
      "page_number": 15,
      "subtopics": [
        "5.8.1 Games (Conventional Modified Games)",
        "5.8.2 Track and Field Events",
        "5.8.3 Traditional Games"
      ],
      "specific_outcomes": [
        "Demonstrate sporting skills",
        "Perform field activities",
        "Perform traditional games"
      ]
    },
    {
      "unit": "5.9",
      "topic_title": "RECREATION",
      "page_number": 15,
      "subtopics": [
        "5.9.1 Dance",
        "5.9.2 Environmental Issues"
      ],
      "specific_outcomes": [
        "Perform traditional dances with rhythm",
        "Perform structured movement in dances.",
        "Perform games with messages of environmental issues"
      ]
    },
    {
      "unit": "5.10",
      "topic_title": "CRAFTS",
      "page_number": 16,
      "subtopics": [
        "5.10.1 Knotting",
        "5.10.2 Modelling",
        "5.10.3 Papier Machè",
        "5.10.4 Construction",
        "5.10.5 Picture Making",
        "5.10.6 Carving",
        "5.10.7 General Crafts"
      ],
      "specific_outcomes": [
        "Knot different items using local materials",
        "Model items using different materials",
        "Make different items using mashed paper",
        "Decorate finished items",
        "Construct toys using different materials",
        "Make collage pictures using different techniques",
        "Carve simple items using suitable wood",
        "Decorate finished carved items",
        "Make different items using local Materials"
      ]
    },
    {
      "unit": "5.11",
      "topic_title": "SWIMMING",
      "page_number": 17,
      "subtopics": [
        "5.11.1 Pool Hygiene",
        "5.11.2 Survival Skills",
        "5.11.3. Water Games"
      ],
      "specific_outcomes": [
        "Discuss effects of poor pool hygiene",
        "Demonstrate simple skilled strokes",
        "Perform competitions in metre races",
        "Perform simple rescue skills",
        "Perform simple water games"
      ]
    }
  ]
}