{
  "meta": {
    "curriculum": "Zambia",
    "grade": "Form 1",
    "subject": "Chemistry",
    "philosophy": "The Chemistry Syllabus for Forms 1 to 4 is designed to equip learners with a comprehensive understanding of chemistry concepts, fostering a deep appreciation for the role of chemistry in everyday life and its applications in various fields. This syllabus aims to develop students' analytical thinking, problem-solving skills, and practical laboratory techniques through a structured and progressive learning approach. Chemistry, as a central science, bridges the gap between physical and biological sciences, providing insights into the composition, structure, properties, and changes of matter. This syllabus emphasises the importance of a hands-on, inquiry-based learning experience, encouraging learners to explore, experiment, and engage in scientific reasoning. This Chemistry Syllabus aims to create a stimulating and supportive learning environment where learners can develop a profound understanding of chemistry. By fostering curiosity, critical thinking, and practical skills, the syllabus prepares learners for further education and careers in science and technology, contributing to their overall intellectual and personal growth. It is hoped that the Chemistry Syllabus will inspire learners to explore the fascinating world of Chemistry and appreciate its significance in shaping the future. The Ordinary Level (O Level) Chemistry Syllabus is committed to providing an enriching and supportive educational environment where learners can develop a lifelong interest in chemistry. By promoting inquiry, curiosity, and a passion for science, we aim to prepare learners not only for academic success but also for their future roles as informed and responsible citizens in a scientifically advanced society. We are confident that this chemistry syllabus will inspire and empower learners to achieve their full potential, equipping them with the knowledge and skills necessary to navigate and contribute to the world around them. This syllabus is designed to ensure learners develop a deep understanding of chemical principles while also acquiring practical skills and competencies needed for further education and careers in science.",
    "competence_learning": "Analytical Thinking: Identify patterns, Compile data, create mental images and address issues, Evaluate solutions. Collaboration: Solving puzzle in groups, Play with peers to build relationships, Participate in and express themselves through play activities. Communication: Use mathematical/scientific language in different situations, Express oneself using different media and symbols, Ask for feedback. Critical Thinking: Ask and answer simple questions, Classify objects according to their attributes, Manipulate different objects, Solve simple problems in life, Match different things according attributes, Arrange objects according to attributes, Compare similarities or differences between objects, Explore the environment, Differentiate good from bad, Recognize and name items in the environment. Environmental Sustainability: Dispose trash in the designated place, Adhere to best practices in environmental management, Identify a clean environment, Identify types of waste in local environment. Problem Solving: Make connections/link with the inner world or social environment, Use numeracy patterns and relations to solve problems, Manipulate numbers, shapes and symbols to complete a task.",
    "goals": [
      "To equip learners with a comprehensive understanding of chemistry concepts.",
      "To foster a deep appreciation for the role of chemistry in everyday life and its applications.",
      "To develop students' analytical thinking, problem-solving skills, and practical laboratory techniques.",
      "To prepare learners for further education and careers in science and technology.",
      "To contribute to learners' overall intellectual and personal growth.",
      "To inspire learners to explore the fascinating world of Chemistry and appreciate its significance in shaping the future.",
      "To provide an enriching and supportive educational environment where learners can develop a lifelong interest in chemistry.",
      "To prepare learners for academic success and for their future roles as informed and responsible citizens in a scientifically advanced society.",
      "To equip learners with the knowledge and skills necessary to navigate and contribute to the world around them.",
      "To ensure learners develop a deep understanding of chemical principles.",
      "To acquire practical skills and competencies needed for further education and careers in science."
    ]
  },
  "topics": [
    {
      "unit": "1.1",
      "topic_title": "INTRODUCTION TO CHEMISTRY",
      "page_number": 3,
      "subtopics": [
        "1.1.1 Branches of Chemistry",
        "1.1.2 Importance of Chemistry",
        "1.1.3 Safety and Waste Management in the Laboratory",
        "1.1.4 Apparatus and Equipment in Chemistry"
      ],
      "specific_outcomes": [
        "1.1.1.1 Demonstrate understanding of chemistry",
        "1.1.2.1 Relate the importance of chemistry to everyday life",
        "1.1.3.1 Apply laboratory safety",
        "1.1.3.2 Manage waste in the laboratory",
        "1.1.4.1 Use apparatus and equipment in chemistry",
        "1.1.4.2 Measure quantities precisely and accurately"
      ]
    },
    {
      "unit": "1.2",
      "topic_title": "MATTER",
      "page_number": 4,
      "subtopics": [
        "1.2.1 States and Basic units of matter",
        "1.2.2 Kinetic theory of matter",
        "1.2.3 Heating and Cooling curves of matter"
      ],
      "specific_outcomes": [
        "1.2.1.1 Demonstrate understanding of states and basic units of matter",
        "1.2.2.1 Demonstrate understanding of the kinetic theory of matter",
        "1.2.3.1 Construct the heating and cooling curves of matter"
      ]
    },
    {
      "unit": "1.3",
      "topic_title": "ELEMENTS, COMPOUNDS AND MIXTURES",
      "page_number": 5,
      "subtopics": [
        "1.3.1 Elements",
        "1.3.2 Compounds",
        "1.3.3 Mixtures",
        "1.3.4 Physical and Chemical changes",
        "1.3.5 Criteria of Purity",
        "1.3.6 Purification and Separation Techniques"
      ],
      "specific_outcomes": [
        "1.3.1.1 Demonstrate understanding of elements in everyday life",
        "1.3.2.1 Demonstrate understanding of compounds",
        "1.3.3.1 Demonstrate understanding of mixtures",
        "1.3.4.1 Differentiate physical and chemical changes",
        "1.3.5.1 Determine the purity of a substance",
        "1.3.6.1 Separate mixtures into their desired components"
      ]
    },
    {
      "unit": "1.4",
      "topic_title": "ATOMIC STRUCTURE",
      "page_number": 6,
      "subtopics": [
        "1.4.1 Structure of an Atom",
        "1.4.2 Properties of the Sub-atomic particles",
        "1.4.3 Atomic number, Z (proton number) and mass number, A (nucleon number)",
        "1.5.1 Chemical Symbols and Nuclide Notation",
        "1.5.2 Electronic Configuration",
        "1.5.3 Isotopic Nature of Elements"
      ],
      "specific_outcomes": [
        "1.4.1.1 Demonstrate understanding of an atom and its structure",
        "1.4.2.1 Explore the properties of the sub-atomic particles",
        "1.4.3.1 Manipulate the numbers of sub-atomic particles",
        "1.5.1.1 Interpret chemical symbols and nuclide notation",
        "1.5.2.1 Apply electronic configuration of atoms",
        "1.5.3.1 Determine relative atomic mass of an element from relative isotopic masses.",
        "1.5.3.2 Manage radioisotopes"
      ]
    }
  ]
}