{
  "meta": {
    "curriculum": "Zambia",
    "grade": "Form 2",
    "subject": "History",
    "philosophy": "History is a scientific study of man, his accomplishments and failures and the evolution of human society in terms of political, economic, social, cultural, artistic, religious and others. The subject offers a wide range of materials that involve numerous skills to grasp. The Zambian Secondary School History syllabus (Form 1 to Form 4) has been tuned to act as a mirror that will reflect to a larger extent the evolution of the Zambian society from pre-colonial time to date. The Syllabus has unveiled a clear historical lay-out of events that will undoubtedly provide responses to some of the social, economic and political challenges the Zambian society is grappling with. A careful selection of global themes has also been done to widen the scope of knowledge for the Zambian learner. In addition, the curriculum integrates cross-cutting issues and themes such as HIV and AIDS, Life Skills, Gender, Human Rights, Reproductive Health, Good Governance, Environmental Education, Water and Sanitation across the curriculum to ensure holistic development of the learner. Throughout the learning process, the curriculum will lead to the development of entrepreneurship skills.",
    "competence_learning": "This syllabus allows for learners to not only acquire knowledge but also apply the (knowledge) skills, values, and attitudes to solve situations they encounter in everyday life. Further, the syllabus emphasises what learners are expected to do rather than mainly focusing on what they are expected to know. At the beginning of each form level (1, 2, 3 and 4), there are competencies and descriptors to be developed by the learners.",
    "goals": [
      "Provide quality, lifelong education that is accessible, inclusive, and relevant to individual, national, and global needs.",
      "Produce young people with a critical mindset, capable of debating, examining, and interpreting national and global issues in light of past events.",
      "Enable citizens to provide well-informed solutions to contemporary world issues and contribute to national development.",
      "Promote a strong national identity and loyalty through the teaching of lessons of individual and collective success."
    ]
  },
  "topics": [
    {
      "unit": "2.1",
      "topic_title": "SLAVERY AND SLAVE TRADE",
      "page_number": 29,
      "subtopics": [
        "2.1.1 Development of Slavery and Slave Trade"
      ],
      "specific_outcomes": [
        "2.1.1.1 Show respect for human dignity"
      ]
    },
    {
      "unit": "2.1",
      "topic_title": "SLAVERY AND SLAVE TRADE",
      "page_number": 30,
      "subtopics": [
        "2.1.2 Europe and the benefits from Slave trade"
      ],
      "specific_outcomes": [
        "2.1.2.1 Analyse Europeans's benefits from slave trade"
      ]
    },
    {
      "unit": "2.1",
      "topic_title": "SLAVERY AND SLAVE TRADE",
      "page_number": 30,
      "subtopics": [
        "2.1.3 Human Trafficking as a modern form of slave trade"
      ],
      "specific_outcomes": [
        "2.1.3.1 Show respect for Human rights"
      ]
    },
    {
      "unit": "2.1",
      "topic_title": "SLAVERY AND SLAVE TRADE",
      "page_number": 30,
      "subtopics": [
        "2.1.4 Slave Trade and Black Friday"
      ],
      "specific_outcomes": [
        "2.1.4.1 Relate Black Friday to modern day commerce"
      ]
    },
    {
      "unit": "2.2",
      "topic_title": "MISSIONARY ACTIVITIES FROM PRE COLONIAL TO POST COLONIAL ZAMBIA",
      "page_number": 31,
      "subtopics": [
        "2.2.1 Missionary Work in Zambia"
      ],
      "specific_outcomes": [
        "2.2.1.1 Analyse impact of missionary activities in Zambia"
      ]
    },
    {
      "unit": "2.3",
      "topic_title": "ESTABLISHMENT OF COLONIAL RULE IN ZAMBIA",
      "page_number": 32,
      "subtopics": [
        "2.3.1 British Occupation of Northern Rhodesia"
      ],
      "specific_outcomes": [
        "2.3.1.1 Analyse process of colonial occupation of Northern Rhodesia"
      ]
    },
    {
      "unit": "2.4",
      "topic_title": "COLONIAL ADMINISTRATION IN NORTHERN RHODESIA",
      "page_number": 32,
      "subtopics": [
        "2.4.1 Types of governance in Northern Rhodesia"
      ],
      "specific_outcomes": [
        "2.4.1.1 Critique colonial types of governance"
      ]
    },
    {
      "unit": "2.4",
      "topic_title": "COLONIAL ADMINISTRATION IN NORTHERN RHODESIA",
      "page_number": 33,
      "subtopics": [
        "2.4.2 The Central African Federation (1953-1963)"
      ],
      "specific_outcomes": [
        "2.4.2.1 Demonstrate understanding of Central African Federation"
      ]
    },
    {
      "unit": "2.5",
      "topic_title": "RESISTANCE TO COLONIAL RULE IN NORTHERN RHODESIA",
      "page_number": 34,
      "subtopics": [
        "2.5.1 Primary and Secondary Resistance to Colonial Rule"
      ],
      "specific_outcomes": [
        "2.5.1.1 Interpret resistance methods to colonial rule"
      ]
    },
    {
      "unit": "2.6",
      "topic_title": "ZAMBIA'S STRUGGLE FOR INDEPENDENCE",
      "page_number": 35,
      "subtopics": [
        "2.6.1 Nationalists in Zambia's Independence Struggle"
      ],
      "specific_outcomes": [
        "2.6.1.1 Appreciate the role of nationalists and Freedom fighters during Independence struggle"
      ]
    }
  ]
}