{
  "meta": {
    "curriculum": "Zambia",
    "grade": "2",
    "subject": "Mathematics and Science",
    "philosophy": "The Lower Primary Mathematics and Science Syllabus is designed for Grades 1 to 3, focusing on foundational concepts from Early Childhood Education (ECE). Mathematics and Science are two interconnected disciplines that shape our understanding of the world around us. Mathematics provides the language and tools to describe and analyse scientific phenomena, while science provides the context and application for mathematical concepts. It emphasises learners demonstrating competences fostering 21st-century skills like communication, critical thinking, and problem-solving. This syllabus prescribes mathematics and science as a single learning area and teaching of Mathematics and Science should be integrated. The course recognises individual potential and creates a dynamic environment for discovering Mathematics and Science. A Combination of these two components provides a solid foundation for Science, Technology, Engineering, and Mathematics (STEM) careers and preparing learners for a diverse range of careers.",
    "competence_learning": "The syllabus has been outlined in such a manner that it integrates mathematics and science content in order to provide learners with a unique experience of appreciating the concepts that the two components endeavor to provide. The syllabus outlines the content in the form of topics, subtopics while the specific competences are meant to respond to the realization of the mathematics and scientific concepts. The topics, sub-topics and competences are arranged in order for easy of reference. Some topics may be similar at both lower and upper sections, but the levels of knowledge, skills and values to be attained are not the same. Hence, when preparing lessons teachers should strive at building on what the learners already know. The approach to teaching and learning is learner-centred. Therefore, in order to develop learners with understanding, skills and values that can contribute to the development of society, the starting point for teaching and learning is to recognize that learners come to school with a wealth of knowledge and experience gained from the family, community and through interaction with the environment. Thus, learning in school must build on the learner’s prior knowledge and experience. This is best achieved when learners are actively involved in the learning process through hands on activities. However, each learner has individual needs, pace of learning, experiences in life and abilities. To accommodate this, the teacher must determine the needs of the learners, and shape the learning experiences accordingly. This learning area, that enhances creativity, analysis, problem solving and an investigative approach, can be taught effectively using a variety of methods both in the classroom and outside. Therefore, teaching methods must be varied but flexible within well-structured sequences of lessons. These include, but not limited to conducting experiments, study tours, field work, presentations, practical work and project work. In order to foster collaboration, learners are encouraged to work in pairs, small groups as well as recognising individual efforts. KEY COMPETENCES TO BE DEVELOPED: Analytical Thinking (Identify patterns, Compile data, create mental images and address issues, Evaluate solutions, Ask questions and answer questions, Establish relationships, patterns and make connections, Apply a set of skills that are appropriate for the creative process.), Communication (Use appropriate mathematical and scientific language (verbal and non-verbal) in different situations, Express oneself using different media and symbols, Ask for feedback, Take turns when conversing with others.), Creativity and Innovation (Observe the environment, Explore the objects around them., Communicate one’s ideas to others, Explore multiple ways of solving a problem.), Collaboration (Solving puzzle in groups, Play with peers to build relationships, Participate in and express themselves through play activities, Complete shared tasks in pairs or groups e.g. sorting, matching.), Critical Thinking (Solve basic problems logically., Ask the basic questions, Work in groups and engage in discussion, Make simple logical conclusions, Tell simple and short stories, Order items according to attributes, Recognise that one item is more than or less than another., Solve simple real-life problem, Explore situations, making sense of time, numbers, patterns and shapes, Apply numbers in real life situations, Identify patterns and shapes, Create new patterns and shapes, Organise things according to their attributes, Identify relationships between things, Work in groups and engage in discussion, Explore the environment, Answer simple questions, Classify items according to their attributes, Manipulate different objects, Solve simple problems in life, Match different things according attributes.), Environmental Sustainability (Recognize and name items in the environment, Arrange items according to magnitude, Compare similarities or differences between different items, Dispose garbage appropriately, Reuse various materials to make artefacts, Identify dangerous chemicals and understand exposure, Recognise causes and effects of climate change., Adapt to weather changes, Care for the environment and natural resource, Identify types of pollution, Prevent pollution, Identify types of waste., Understand of waste management), Financial Literacy (State the value of different coins and notes., Identify ways of earning money, Demonstrate the ability to Save money, Make a List of items to buy), Problem Solving (Use knowledge of alphabet to construct new words, Use simple reference materials, Use numeracy patterns and relations to solve mathematical problems, Provide solutions to questions and challenging situations within their environment, Manipulate numbers, shapes and symbols to complete a task, Solve problems within the context using oral, written, symbolic, graphical and numerical materials)",
    "goals": [
      "Exploring My World: \"Exploring My World\" is a comprehensive early learning package designed to foster curiosity, creativity, critical thinking and problem-solving skills in learners. Through interactive lessons, engaging learning activities, and hands-on experiences, learners can delve into various aspects of our world by grouping and counting things explored in the surroundings.",
      "Understanding my Body: Understanding My Body\" is designed to introduce learners to the basics of human anatomy, health, and hygiene. It covers subtopics such as The Human Body and Water borne and Food borne diseases which involve naming and counting different body parts. Also, measuring and comparing lengths of different body parts.",
      "Exploring the Sky and Seasons: \"Exploring the Sky and Seasons\" is a package to help learners to explore the fascinating world of astronomy and seasonal changes. It includes subtopics: Time and length, and weather and climate change which is meant to support learners delve into various aspects of the sky and seasons by telling time using activities of the day and weather changes in daily life. Also to explore different masses and capacity of things.",
      "Understanding Materials: \"Understanding Materials\" is meant to help learners explore the properties, uses, and applications of different materials. It contains subtopics Materials, Energy, Sound, light, Soluble and Insoluble substances, Forces, Simple Machines, Shapes and Patterns, Safe water and Surroundings. These are meant to help learners explore the physical properties of different materials, such as texture, color, shape, and size. Also, identifying and making shapes and patterns using different materials and using clean and safe water from the surroundings.",
      "Exploring Mixtures: \"Exploring Mixtures\" is meant support learners to develop their understanding of mixtures. It has subtopics Addition, Subtraction, Multiplication and Division of things from the environment though experiments, and investigation to make and mix things. Also, these subtopics help learners on how to manage waste at household level."
    ]
  },
  "topics": [
    {
      "unit": "2.1",
      "topic_title": "EXPLORING MY WORLD",
      "page_number": 111,
      "subtopics": [
        "2.1.1 Grouping Things"
      ],
      "specific_outcomes": [
        "2.1.1.1 Use set notation to show membership of things",
        "2.1.1.2 Express whole numbers in a variety of ways",
        "2.1.1.3 Investigate the structure of a plant.",
        "2.1.1.4 Demonstrate care for plants.",
        "2.1.1.5 Interpret chemical labels.",
        "2.1.1.6 Analyse data",
        "2.1.1.7 Prevent common diseases",
        "2.1.1.8 Exhibit care for the environment."
      ]
    },
    {
      "unit": "2.2",
      "topic_title": "UNDERSTANDING MY BODY",
      "page_number": 114,
      "subtopics": [
        "2.2.1 The Human Body"
      ],
      "specific_outcomes": [
        "2.2.1.1 Demonstrate understanding of parts of the human body and their functions.",
        "2.2.1.2 Use relations in life context",
        "2.2.1.3 Practise food hygiene.",
        "2.2.1.4 Apply good eating habits"
      ]
    },
    {
      "unit": "2.3",
      "topic_title": "EXPLORING THE SKY AND SEASONS",
      "page_number": 116,
      "subtopics": [
        "2.3.1 Time and length",
        "2.3.2 Weather and Climate change"
      ],
      "specific_outcomes": [
        "2.3.1.1 Use standard units of measures in everyday life",
        "2.3.2.1 Recognise the significance of weather changes."
      ]
    },
    {
      "unit": "2.4",
      "topic_title": "EXPLORING MATERIALS",
      "page_number": 117,
      "subtopics": [
        "2.4.1 Materials",
        "2.4.2 Energy",
        "2.4.3 Plane and Solid Shapes",
        "2.4.4 Sound",
        "2.4.5 Light",
        "2.4.6 Soluble and Insoluble materials"
      ],
      "specific_outcomes": [
        "2.4.1.1 Explore the existence of matter.",
        "2.4.2.1.1 Use energy sustainably",
        "2.4.3.1 Make three dimensional regular shapes",
        "2.4.4.1 Make different sounds.",
        "2.4.5.1 Classify sources of light in the environment",
        "2.4.6.1.1 Analyse the solubility of materials in water"
      ]
    },
    {
      "unit": "2.5",
      "topic_title": "EXPLORING MIXITURES",
      "page_number": 119,
      "subtopics": [
        "2.5.1 Addition, Subtraction, Multiplication and Division of Things",
        "2.5.2 Domestic waste"
      ],
      "specific_outcomes": [
        "2.5.1.1 Use whole numbers in addition, in different situation",
        "2.5.1.2 Use whole numbers in Subtraction in different situations",
        "2.5.1.3 Use whole numbers in multiplication in life situation",
        "2.5.1.4 Use whole numbers in division in different life situations",
        "2.5.2.1 Manage waste."
      ]
    }
  ]
}