{
  "meta": {
    "curriculum": "Zambia",
    "grade": "Form 2",
    "subject": "Mathematics I",
    "philosophy": "This syllabus is committed to providing an enriching and supportive educational environment where learners can develop a lifelong interest for Mathematics. By promoting inquiry, curiosity, and a passion for Mathematics, we aim to prepare learners not only for academic success but also for their future roles as informed and responsible citizens in a scientifically advanced society. This syllabus is designed to ensure learners develop a deep understanding of Mathematical concepts while also acquiring practical skills and competencies needed for further education and careers in Mathematics. The Form 1-4 Ordinary Mathematics I syllabus is designed to provide you with a comprehensive overview and understanding of fundamental Mathematical concepts based on their interconnectedness. The syllabus has been prepared and produced against the background of the need to set high standards for Mathematics education and actualize the country's vision from Early Childhood to tertiary education. Some topics have been revised to suit the 21st Century learners to help them gain competencies that they can utilize in life beyond school. A wide range of concepts including Numbers, Algebra, Measures, Geometry, Relations & Functions, Trigonometry, Statistics & Probability among others have been included in this syllabus.",
    "competence_learning": "The Ordinary Level Mathematics I Syllabus is crafted with a firm commitment to competence-based education, recognizing the importance of not just acquiring knowledge, but rather the development of critical and analytical thinking, problem-solving skills and conceptual understanding. At the heart of this syllabus, lies the principle of competence-based learning, which prioritizes the mastery of essential skills and concepts over mere coverage of content. Mathematical competence is the ability to develop and apply mathematical thinking in order to solve a range of problems in everyday situations. Mathematical competences involve the ability and willingness to use Mathematical modes of thought (logical and spatial thinking) and presentation (formulas, models, constructions, graphs, charts). The mathematics competence is developed step-by- step over a period of instruction after learning a set of specific competencies. In mathematics, a specific competence refers to a particular skill, value, or knowledge and attitude that enables learners to perform a specific mathematical task, solve a particular type of problem, or demonstrate understanding of a distinct mathematical concept. This may be achieved after performing several learning activities for a specific instruction.",
    "goals": [
      "Provide an enriching and supportive educational environment for a lifelong interest in Mathematics.",
      "Prepare learners for academic success and future roles as informed and responsible citizens.",
      "Equip learners with the knowledge and skills necessary to navigate and contribute to the world around them.",
      "Develop a deep understanding of Mathematical concepts and acquire practical skills and competencies for further education and careers.",
      "Develop essential skills and knowledge in numeracy, problem-solving, critical thinking, and logical reasoning.",
      "Serve as a foundation for more advanced Mathematical studies in disciplines such as calculus, algebra, geometry, statistics, and trigonometry.",
      "Enable learners to apply mathematical principles in practical scenarios and make informed decisions based on data and analysis.",
      "Cultivate problem-solving skills by teaching learners how to analyze problems, break them down into manageable parts, and develop systematic approaches.",
      "Foster critical thinking skills, analytical reasoning, and the ability to evaluate information logically.",
      "Equip learners with numeracy skills needed to navigate today's data-driven world.",
      "Contribute to cognitive development by fostering abstract thinking, spatial reasoning, pattern recognition, and mathematical creativity.",
      "Prepare learners for global competitiveness in a rapidly evolving and technologically advanced society."
    ]
  },
  "topics": [
    {
      "unit": "2.1",
      "topic_title": "COORDINATE GEOMETRY",
      "page_number": 23,
      "subtopics": [
        "2.1.1 Cartesian Plane"
      ],
      "specific_outcomes": [
        "2.1.1.1 Use the concept Cartesian Plane to solve problems in real life situations"
      ]
    },
    {
      "unit": "2.1",
      "topic_title": "COORDINATE GEOMETRY",
      "page_number": 24,
      "subtopics": [
        "2.1.2 Straight lines on the Cartesian Plane"
      ],
      "specific_outcomes": [
        "2.1.2.1 Use straight lines to solve problems in real life"
      ]
    },
    {
      "unit": "2.2",
      "topic_title": "RELATIONS AND FUNCTIONS",
      "page_number": 24,
      "subtopics": [
        "2.2.1 Relations"
      ],
      "specific_outcomes": [
        "2.2.1.1 Apply relations to model and solve problems"
      ]
    },
    {
      "unit": "2.2",
      "topic_title": "RELATIONS AND FUNCTIONS",
      "page_number": 25,
      "subtopics": [
        "2.2.2 Functions"
      ],
      "specific_outcomes": [
        "2.2.2.1 Apply functions to model and solve problems"
      ]
    },
    {
      "unit": "2.3",
      "topic_title": "ALGEBRA",
      "page_number": 25,
      "subtopics": [
        "2.3.1 Basic Processes of Algebra"
      ],
      "specific_outcomes": [
        "2.3.1.1 Use algebraic expressions in problem solving"
      ]
    },
    {
      "unit": "2.4",
      "topic_title": "POLYGONS",
      "page_number": 26,
      "subtopics": [
        "2.4.1 Regular and Irregular Polygons"
      ],
      "specific_outcomes": [
        "2.4.1.1 Create different objects using polygons"
      ]
    },
    {
      "unit": "2.5",
      "topic_title": "SYSTEMS OF EQUATIONS",
      "page_number": 26,
      "subtopics": [
        "2.5.1 Simultaneous Equations"
      ],
      "specific_outcomes": [
        "2.5.1.1 Use simultaneous equations in real life situations."
      ]
    },
    {
      "unit": "2.6",
      "topic_title": "TRAVEL GRAPHS",
      "page_number": 26,
      "subtopics": [
        "2.6.1 Distance time Graphs"
      ],
      "specific_outcomes": [
        "2.6.1.1 Apply distance time graphs in a variety of perspectives"
      ]
    },
    {
      "unit": "2.6",
      "topic_title": "TRAVEL GRAPHS",
      "page_number": 27,
      "subtopics": [
        "2.6.2 Velocity time Graphs"
      ],
      "specific_outcomes": [
        "2.6.2.1 Apply velocity time graphs in a variety of perspectives"
      ]
    },
    {
      "unit": "2.7",
      "topic_title": "FINANCIAL ARITHMETIC",
      "page_number": 27,
      "subtopics": [
        "2.7.1 Financial Interest"
      ],
      "specific_outcomes": [
        "2.7.1.1 Apply the Financial Interest in everyday life"
      ]
    },
    {
      "unit": "2.7",
      "topic_title": "FINANCIAL ARITHMETIC",
      "page_number": 28,
      "subtopics": [
        "2.7.2 Investment"
      ],
      "specific_outcomes": [
        "2.7.2.1 Apply the concept of Investment in everyday life"
      ]
    }
  ]
}