{
  "meta": {
    "curriculum": "Zambia",
    "grade": "3-4 Years",
    "subject": "English Language",
    "philosophy": "The English Language Syllabus for ECE (Levels 3-4 and 4-5) is designed to help children aged three to five develop the four language skills: listening, speaking, reading and writing. The syllabus has been developed to ensure consistent exposure to and practice of language. This will help learners become fluent and successful in academics as they progress to Grade 1 and beyond.",
    "competence_learning": "This syllabus is divided into three components namely; Listening and Speaking, Pre-reading and Pre-writing. Each of these components has a range of topics and corresponding sub-topics. In order to maintain a uniform and cohesive delivery of content to learners, specific-competences and their subsequent learning activities have been identified to facilitate effective learning. Additionally, the expected standards of performance have been clearly indicated as benchmark for the desired level of proficiency and achievement. This structured approach ensures a consistent and organised learning experience for all learners. The Ministry of Education has suggested methodologies as a guide to teachers. In saying this, teachers are encouraged to use the best practices for their own classes and context to enhance learning outcomes. Listening and Speaking Lessons: The teaching method suggested in this syllabus for listening and speaking (Oral English) follows the three Ps' strategy - Present (The teacher will model the language for the day), Practice (Allow the learners to engage with the language in controlled practice activities), and Produce (Now allow the learners to use the language in communicative contexts independently). The approach includes various methods like pair work, group activities, role-play, interactive language games, songs, rhymes, dialogue and conversation. Additionally, educators are encouraged to use a variety of teaching methods and techniques to enhance the foundation for development of Pre-reading and Pre-writing skills among learners. Teachers are encouraged to trans-language by using accommodation strategies such as code switching in instances where learners are not exposed to English as their first language. Teachers are encouraged to teach all components of Literacy and Language in English in one lesson and model all lessons using play strategies.",
    "goals": [
      "Develop the four language skills: listening, speaking, reading and writing",
      "Become fluent and successful in academics as they progress to Grade 1 and beyond"
    ]
  },
  "topics": [
    {
      "unit": "0.1.1",
      "topic_title": "NAMING",
      "page_number": 15,
      "subtopics": [
        "Own Name",
        "Friend's Name",
        "Names of Family Members",
        "Things at Home",
        "Things at School",
        "Things in the Environment"
      ],
      "specific_outcomes": [
        "Tell own name accordingly.",
        "Tell name of friend correctly.",
        "Tell names of family members accordingly.",
        "Name things found at home correctly.",
        "Name things found in a classroom correctly.",
        "Name things found in the environment correctly."
      ]
    },
    {
      "unit": "0.1.2",
      "topic_title": "CONVERSATION",
      "page_number": 15,
      "subtopics": [
        "Greetings.",
        "Simple Commands",
        "Permission",
        "Likes and Dislikes"
      ],
      "specific_outcomes": [
        "Use appropriate greetings at different times of the day correctly.",
        "Listen and respond to simple commands appropriately.",
        "Use appropriate language for asking and giving permission appropriately.",
        "Talk about likes and dislikes accordingly."
      ]
    },
    {
      "unit": "0.1.3",
      "topic_title": "STORIES",
      "page_number": 16,
      "subtopics": [
        "Simple Stories",
        "Picture Stories"
      ],
      "specific_outcomes": [
        "Listen and respond to simple stories correctly.",
        "Re-tell simple stories accordingly.",
        "Interpret and tell stories based on pictures correctly."
      ]
    },
    {
      "unit": "0.1.4",
      "topic_title": "DESCRIPTIONS",
      "page_number": 17,
      "subtopics": [
        "Describing Things",
        "Chores",
        "Daily Activities"
      ],
      "specific_outcomes": [
        "Describe things according to their attributes correctly.",
        "Describe home chores accordingly.",
        "Describe daily activities accordingly."
      ]
    },
    {
      "unit": "0.1.5",
      "topic_title": "RHYMES",
      "page_number": 17,
      "subtopics": [
        "Rhymes"
      ],
      "specific_outcomes": [
        "Recite short rhymes correctly."
      ]
    },
    {
      "unit": "0.1.6",
      "topic_title": "TONGUE TWISTERS",
      "page_number": 17,
      "subtopics": [
        "Tongue twisters"
      ],
      "specific_outcomes": [
        "Recite short tongue twisters correctly."
      ]
    },
    {
      "unit": "0.1.7",
      "topic_title": "SONGS",
      "page_number": 17,
      "subtopics": [
        "Simple Songs"
      ],
      "specific_outcomes": [
        "Sing simple songs correctly."
      ]
    },
    {
      "unit": "0.1.8",
      "topic_title": "DRAMA",
      "page_number": 18,
      "subtopics": [
        "Simple Plays"
      ],
      "specific_outcomes": [
        "Dramatise simple stories and plays correctly.",
        "Use appropriate language to show sympathy accordingly.",
        "Use appropriate language to talk about food hygiene appropriately.",
        "Use appropriate language to talk about simple events correctly.",
        "Use appropriate language for buying and selling correctly."
      ]
    },
    {
      "unit": "0.1.9",
      "topic_title": "VISUAL DISCRIMINATION",
      "page_number": 19,
      "subtopics": [
        "Book Handling",
        "Left to Right Eye Movement.",
        "Matching",
        "Identification",
        "Odd One Out",
        "Visual Memory",
        "Own Name",
        "Picture Reading"
      ],
      "specific_outcomes": [
        "Demonstrate correct book handling habits.",
        "Practise left to right eye movement, demonstrating it correctly and ordering objects from left to right.",
        "Demonstrate left to right eye movement correctly and match things from left to right.",
        "Identify and match objects according to their attributes correctly.",
        "Arrange items according to size correctly.",
        "Discriminate objects according to attributes correctly.",
        "Recall objects and experiences from memory correctly.",
        "Recognise own name correctly.",
        "Read pictures correctly."
      ]
    },
    {
      "unit": "0.1.10",
      "topic_title": "SOUND RECOGNITION",
      "page_number": 20,
      "subtopics": [
        "Initial and End Sounds"
      ],
      "specific_outcomes": [
        "Recognise initial and end sounds orally in simple words correctly."
      ]
    },
    {
      "unit": "0.1.11",
      "topic_title": "HANDWRITING",
      "page_number": 21,
      "subtopics": [
        "Eye Hand Coordination",
        "Sitting Posture",
        "Hand /Finger Manipulation",
        "Pencil Grip",
        "Scribbling",
        "Pattern work",
        "Letters",
        "Creative Expression",
        "Shapes",
        "Copying Own Name",
        "Matching Images"
      ],
      "specific_outcomes": [
        "Demonstrate simple eye-hand coordination activities correctly.",
        "Demonstrate correct sitting posture.",
        "Practise finger and hand exercises correctly.",
        "Hold pencil using the tripod grip correctly.",
        "Express oneself through scribbling accordingly.",
        "Trace and draw lines and patterns using templates correctly.",
        "Mould different shapes of letters using clay correctly.",
        "Trace letters of the alphabet accurately.",
        "Colour different objects and letters accordingly.",
        "Form a series of shapes accurately.",
        "Copy a series of shapes accurately.",
        "Copy own name from name cards accurately.",
        "Match images to their initial letters correctly."
      ]
    }
  ]
}