{
  "curriculum": "Zambia ECZ",
  "grade": "11",
  "subject": "Biology",
  "topics": [
    {
      "unit": "Concepts and Method in Biology",
      "subtopics": [
        "Research Project in Biology"
      ],
      "learning_outcomes": "Conduct a research project by Carrying out research ( data collection, data analysis, write a research report and make presentations ); Developing an innovation to resolve a Biological related problem."
    },
    {
      "unit": "Principles of Cellular Life",
      "subtopics": [
        "Cell Division"
      ],
      "learning_outcomes": "Demonstrate understanding of the process of cell division by Demonstrating the stages of cell division ( mitosis and meiosis: Interphase, Prophase, Metaphase, Anaphase, and Telophase ); Observing cell division using a microscope; Evaluating the importance of mitosis and meiosis ( Meiosis : reproduction, Mitosis : growth, uncontrolled cell division, cancer )."
    },
    {
      "unit": "Maintenance of the Organism",
      "subtopics": [
        "Excretion in Plants and Animals",
        "Homeostasis in Human Beings"
      ],
      "learning_outcomes": "Explore the mechanism of excretion in plants and animals by Describing the process of excretion in plants and animals; Identifying excretory structures in plants ( seeds, roots, stems, leaves, xylem, fruits, flowers ); Carrying out experiments to identify excretory products in plants ( latex, oils, anthocyanin, cyanide, resins, mucilage, oxygen and carbon dioxide ); Identifying the excretory organs and products in animals. (Kidneys: nitrogenous wastes, Lungs: carbon dioxide, skin: excess salts, urea ); Relating the organs of the urinary system to their functions (kidney, ureter, renal blood vessels, urinary bladder, urethra ); Relating the internal structures of the kidney to their functions (cortex, medulla, pelvis and pyramid ); Describing the mechanism of excretion in the kidney. (ultrafiltration, selective re-absorption and osmoregulation in the nephron ); Identifying common disorders and diseases associated with the kidney ( Kidney stones, nephritis, Kidney failure ); Investigating the role of the lungs in excretion ( elimination of carbon dioxide ); Describing the role of the human skin in excretion (removal of excess salts, urea as waste products ); Explaining the importance of excretion to plants and animals (removal of unwanted products and toxic wastes; regulation of water content of body fluids and pH); Exploring ways of managing the common disorders and diseases associated with excretory organs; the kidney (dialysis machine and kidney transplant, treatment of infections ); Exploring ways in which excretory products are used in everyday life ( rubber and glue making, carbonated drinks ). Analyse the mechanism of the process of homeostasis in human beings by Describing homeostasis; Identifying organs involved in homeostasis ( kidney, skin and liver ); Analysing the role of the kidney in maintaining the balance of water and salt ions ( ref. Anti-diuretic hormone: ADH ); Relating the structure of the skin to its functions; Analysing the mechanism of thermoregulation by the skin (overheating: vasodilation and sweating; overcooling: vasoconstriction and shivering ); Exploring the role of the liver in the regulation of blood sugar and body temperature; Practising healthy habits for proper maintenance of the internal environment of human beings ( keeping warm when it’s cold, taking less sugar or salt… )."
    },
    {
      "unit": "Continuity of Life",
      "subtopics": [
        "Heredity"
      ],
      "learning_outcomes": "Demonstrate understanding of inheritance of traits in plants and animals by Describing inheritance; Exploring the terms used in the study of genetics( Gene, allele, chromosome, dominance-complete and co-dominance; genotype, phenotype, dominant gene, recessive gene, gamete, first filial generation-F1, second filial generation-F2 ); Illustrating monohybrid inheritance ( genetic diagram, Punnett square ); Demonstrating the inheritance of human characteristics (height, eye colour, albinism ); Demonstrating the inheritance of plant characteristics ( leaf shape, seed/flower colour, height, flower scent ); Determining the sex of a human being ( X and Y chromosomes ); Exploring the inheritance of sex-linked characteristics ( red-green colour blindness and haemophilia ); Illustrating the mechanism of ABO blood group inheritance (ABO blood group inheritance ); Describing mutation (chromosome and gene mutation ); Identifying the causes of mutation ( natural radiation -nuclear emission, x-rays and ultra-violet light ); Explaining effects of mutation (Down’s Syndrome, haemophilia, sickle cell anaemia ); Applying mutations in everyday life ( induced mutation in Agriculture-Polyploidy…). Explore variation in plants and animals by Describing variations in living organisms ( Refer to animals and plants-continuous and discontinuous ); Investigating variations in human beings ( Eye colour, skin colour, finger print, tongue rolling, height ); Investigating variations in flowering plants ( fruit structure and scent, height -tall, dwarf. Include leaf size, shape, and weight ); Distinguishing continuous and discontinuous variations (Continuous: height, skin colour, body mass; discontinuous variations: eye colour, blood group, sex and tongue rolling ); Investigating the factors that cause variations among plants and animals of the same species (genetic factors, climatic factors, nutrition, soils ); Applying the concept of inheritance to influence intended characteristics in plants and animals."
    },
    {
      "unit": "Coordination and Response",
      "subtopics": [
        "Sense Organs in Human Beings",
        "The Skeletal System"
      ],
      "learning_outcomes": "Analyse the sense organs in human beings by Describing sense organs ( eye, ear, skin, tongue and nose ); Relating the external and internal structures of the eye to their functions; Demonstrating accommodation of the eye; Exploring the causes of short and long sightedness; Explaining the correction of short and long sight; Investigating the common causes and methods of preventing blindness ( causes: Vitamin A deficiency, filarial worm, physical injury and diabetes mellitus. Prevention: foods rich in Vitamin A, surgery ); Drawing and labeling the external and internal structure of the human ear ( outer : pinna, auditory canal; middle :ear drum, ossicles and Eustachian tube; inner ears : semi-circular canals, cochlea, oval window ); Relating the parts of the ear to their functions ( eardrum, ossicles, Eustachian tube, cochlea and semi-circular canals ); Investigating the causes and methods of preventing deafness; Exploring the role of the skin as a sense organ ( sensory receptors for heat, pain, touch and pressure ); Exploring the role of the tongue as a sense organ ( taste buds, test receptors, fungiform papillae, glossopharyngeal nerve ); Exploring the role of the nose as a sense organ ( nostrils, nasal cavity, olfactory epithelium, olfactory receptors, olfactory nerve ); Caring for sense organs to prevent damage; Relating the sense organs to the nervous system; Identifying the interdependence of the sense organs on each other. Examine the structures and composition of skeletons by Describing the Skeletal System in animals ( invertebrates and vertebrates ); Exploring the functions of the skeleton ( support, protection, structure and locomotion ); Identifying various types of skeletons ( hydrostatic, exoskeleton and endoskeleton ); Investigating the structure and composition of an exoskeleton (skeleton of an insect ); Identifying joints and muscles in the limbs of a grasshopper (flexors and extensors ); Describing the general plan of the endoskeleton ( bones of the axial and the appendicular skeleton; Axial skeleton: skull, vertebral column; Appendicular skeleton: girdles, limbs ); Explaining a bone as a living tissue ( living cells in bones, production of red blood cells ); Describing the structure of a skeletal muscle ( shape and quantity of mitochondria ); Demonstrating the action of antagonistic muscles (contraction and relaxation of biceps and triceps; circular and longitudinal muscles in oesophagus, circular and radial muscles in the in iris ); Identifying the parts and functions of the synovial joint (functions of the cartilage, ligament, capsule, synovial fluid and membrane ); Distinguishing the ball and socket joint and the hinge joint (movement, location, structure ); Comparing the joints, muscle attachment and movement in endoskeletons and exoskeleton (endoskeleton: human beings and exoskeleton: insects ); Investigating the skeletal disorders ( bone disorders: cancer, TB, osteopenia, osteoporosis, rickets, fracture, polio; Joint disorders: Gout, arthritis, dislocation, sprain, tendinitis ); Managing the skeletal disorders (diet, treatment ); Applying First-Aid measures during injury of bones."
    },
    {
      "unit": "Ecological Relationship and Evolution",
      "subtopics": [
        "Biodiversity",
        "Conservation of Natural Resources",
        "Natural Selection",
        "Evolution"
      ],
      "learning_outcomes": "Conserve biodiversity in the environment by Describing biodiversity of living organisms; Investigating diversity of organisms in a given ecosystem (school grounds, a pond or nearby wetland, organic reserves ); Evaluating the importance of diversity of organisms in an ecosystem ( equilibrium of organisms in the ecosystem ); Investigating the impact of human activity on biodiversity (human activities: poaching, encroachment, human-animal conflict, poor fishing methods, deforestation, industrialisation, charcoal production, open air burning. Impact: threatened extinction of organisms, climate change, pollution, loss of habitat for organisms, outbreak of diseases ); Evaluating effectiveness of legislation in conserving of Biodiversity in Zambia; Exploring the economic reasons for maintaining bio-diversity (source of income through tourism, aesthetic value, source of medicine, source of food… ); Conserving Bio-diversity in the local environment. Practise sustainable use of natural resources in the local environment by Exploring the importance of conserving plant and animal species ( preserving biodiversity, climate change mitigation, research, nutrient cycling, source of food, prevent extinction, source of medicine ); Practising effective ways of using natural resources sustainably ( 3Rs: reuse, reduce and recycle materials ). Applying the principles of natural selection in real world by Exploring the four principles of natural selection ( variation, survival of the fittest, inheritance and mutation ); Analysing how some organisms are adapted to the environment (adaptive characteristics of organisms: tortoise, chameleon, earth worm, pine trees, cacti, aloe vera ); Evaluating the importance of natural selection ( improved plant varieties and animal breeds, disease resistance, genetic diversity, regulation of population size, eliminating undesirable genes/traits ). Explore the process of evolution by Describing evolution ( change of organisms over time through changes in their genetic material ); Investigating causes of evolution ( mutation, natural selection, genetic drift, gene flow, non-random mating)."
    }
  ]
}