{
  "curriculum": "Zambia ECZ",
  "grade": "3",
  "subject": "Mathematics and Science",
  "topics": [
    {
      "unit": "EXPLORING MY WORLD",
      "subtopics": [
        "Grouping Things",
        "Things in the Surroundings",
        "Express whole numbers in a variety of ways",
        "Classify foods according to their nutrients",
        "Analyse components of soil",
        "Practise care for the surroundings"
      ],
      "learning_outcomes": "Apply relationship between sets. Apply the benefit of natural resources in daily life. Analyse water cycle process. Express whole numbers in a variety of ways. Classify foods according to their nutrients. Analyse components of soil. Practise care for the surroundings."
    },
    {
      "unit": "UNDERSTANDING MY BODY",
      "subtopics": [
        "The Human Body",
        "Practise care for the human body",
        "Practise Personal Hygiene",
        "Use relations in different life context"
      ],
      "learning_outcomes": "Exhibit care for the sensory organs. Practise care for the human body. Practise Personal Hygiene. Use relations in different life context."
    },
    {
      "unit": "EXPLORING THE SKY AND SEASONS",
      "subtopics": [
        "Time, length, mass and capacity",
        "Weather and Climate Change"
      ],
      "learning_outcomes": "Use measures in everyday life. Demonstrate understanding of causes of climate change."
    },
    {
      "unit": "EXPLORING MATERIALS",
      "subtopics": [
        "Materials",
        "Plane and Solid Shapes",
        "Forces",
        "Simple Machines"
      ],
      "learning_outcomes": "Investigate characteristics of materials. Construct different types of shapes. Analyse the relationship between forces and movement of objects. Make simple machines."
    },
    {
      "unit": "EXPLORING MIXTURES",
      "subtopics": [
        "Mixtures",
        "Addition, Subtraction, Multiplication and Division of Things",
        "Use whole numbers in subtraction in different life situations",
        "Use whole numbers in multiplication in different life situations",
        "Use whole numbers in division in different life situations",
        "Use fractions in life situations"
      ],
      "learning_outcomes": "Create different types of mixtures. Use whole numbers in Addition in different situations. Use whole numbers in subtraction in different life situations. Use whole numbers in multiplication in different life situations. Use whole numbers in division in different life situations. Use fractions in life situations."
    }
  ]
}