{
  "curriculum": "Zambia ECZ",
  "grade": "2",
  "subject": "Zambian Languages",
  "topics": [
    {
      "unit": "STORIES",
      "subtopics": [
        "Listening to Stories",
        "Story telling"
      ],
      "learning_outcomes": "Listen to grade level stories. Retell stories creatively. Tell stories creatively."
    },
    {
      "unit": "CONVERSATIONS",
      "subtopics": [
        "Information and Explanations",
        "Ask relevant questions to get better understanding and knowledge",
        "Discussion",
        "Debate"
      ],
      "learning_outcomes": "Use complete sentences to communicate information. Ask relevant questions to get better understanding and knowledge. Take part in discussions. Participate in simple debates."
    },
    {
      "unit": "DESCRIPTIONS",
      "subtopics": [
        "People",
        "Places",
        "Objects"
      ],
      "learning_outcomes": "Give physical descriptions of people. Give descriptions of places. Give descriptions of objects."
    },
    {
      "unit": "DRAMA",
      "subtopics": [
        "Role play"
      ],
      "learning_outcomes": "Participate in role play."
    },
    {
      "unit": "RIDDLES AND TONGUE TWISTERS",
      "subtopics": [
        "Riddles",
        "Tongue Twisters"
      ],
      "learning_outcomes": "Say and respond to riddles. Recite tongue twisters."
    },
    {
      "unit": "READING FLUENCY",
      "subtopics": [
        "Oral Reading"
      ],
      "learning_outcomes": "Read aloud syllables formed by three or more consonant clusters. Read words of increasing number of syllables. Read texts of 5-7 sentences fluently. Read own writing fluently."
    },
    {
      "unit": "SYNONYMS AND ANTONYMS",
      "subtopics": [
        "Synonyms",
        "Antonyms",
        "Singular and Plural Nouns"
      ],
      "learning_outcomes": "Identify synonyms. Identify antonyms. Form plural and singular nouns."
    },
    {
      "unit": "NOUNS",
      "subtopics": [
        "Proper Nouns",
        "Common Nouns"
      ],
      "learning_outcomes": "Identify proper nouns. Identify common nouns."
    },
    {
      "unit": "COMPREHENSION",
      "subtopics": [
        "Making Inferences",
        "Word Meaning",
        "Main Idea",
        "Life Experiences",
        "Story Summary",
        "Story Facts",
        "Identify the main idea in a story",
        "Recall order of events in a text",
        "Predictions",
        "Making Inferences",
        "Life Experiences"
      ],
      "learning_outcomes": "Draw inferences from the information they have heard. Deduce the meaning of unfamiliar grade level words. Express the main idea of the information they have listened to. Link their own life experiences to what they listen to. Summarise stories. Provide explicitly stated information in a given grade level text. Identify the main idea in a story. Recall order of events in a text. Make predictions based on given information. Draw inferences from written material. Link their own life experiences to what they have read."
    },
    {
      "unit": "HANDWRITING",
      "subtopics": [
        "Manuscript Writing"
      ],
      "learning_outcomes": "Write words of increasing number of syllables legibly in manuscript form. Write sentences in manuscript form."
    },
    {
      "unit": "COMPOSITION",
      "subtopics": [
        "Drawing",
        "Punctuation",
        "Sentences",
        "Fiction",
        "Non fiction"
      ],
      "learning_outcomes": "Communicate ideas through drawing. Use the main punctuation marks (capital letters, full stop, comma and question mark). Write complete sentences. Compose and write a short fiction story of 3 to 4 sentences. Compose and write a short exposition."
    }
  ]
}