{
  "curriculum": "Zambia ECZ",
  "grade": "10",
  "subject": "Biology",
  "topics": [
    {
      "unit": "Concepts and Methods in Biology",
      "subtopics": [
        "Chemicals of Life",
        "Food Confirmatory Tests",
        "Research Proposal"
      ],
      "learning_outcomes": "Explore the chemicals of life by Describing the chemicals of life; Identifying the chemicals of life ( carbohydrates, proteins, lipids and nucleic acids ); Using the burn test to determine the organic molecules; Analysing the chemical composition of carbohydrates, lipids and proteins ( include the building blocks ); Writing molecular and structural formulae of the common carbohydrates, proteins and lipids and their monomers; Constructing molecular structural models of the molecules of life; Describing hydrolysis and dehydration synthesis reactions and their relevance to biological molecules; Evaluating the significance of the chemicals of life. Prepare reagents used in investigating the chemicals of life by Preparing reagents using provided chemicals ( Benedict’s solution: hydrated copper (II) sulphate, sodium carbonate, sodium citrate and distilled water, Iodine solution: iodine crystals, potassium iodide and distilled water; and Biuret reagent: hydrated copper (II) sulphate, sodium hydroxide and distilled water- add hydrated sodium potassium tartrate as a stabiliser ). Carry out confirmatory tests for the presence of chemicals of life in food samples by Carrying out food tests for reducing sugar, non-reducing sugar, proteins, lipids and starch. Formulate a research proposal by Outlining components of a research proposal ( title, background, statement of the problem, aim, purpose of the study, objectives of the study, research questions, hypothesis, significance of the study, limitations, delimitations of the study, definition of operational terms, time frame, bibliography, literature review, methodology, Budget ); Designing a research proposal based on a given topic or identified problem."
    },
    {
      "unit": "Principles of Cellular Life",
      "subtopics": [
        "Movement of Substances Across the Cell",
        "Energy and Metabolism",
        "Enzymes and Their Actions"
      ],
      "learning_outcomes": "Analyse the movement of substances across the cell membrane by Describing the processes of diffusion, osmosis and active transport; Experimenting on diffusion and osmosis; Investigating the factors that affect diffusion and osmosis; Investigating the effects of osmosis on plant and animal tissues ( plasmolysis, turgidity, crenation, cell lysis ); Applying the principle of movement of substances across cell membranes to real life situations. Analyse metabolism processes in living cells by Describing the types of metabolism ( anabolism: photosynthesis, protein synthesis; catabolism: respiration ); Comparing and contrasting the types of metabolism. Demonstrate understanding of enzymes and their actions by Investigating enzymes and their actions; Analysing characteristics of enzymes; Applying nomenclature to identify the enzymes acting on the given substrate; Investigating the factors that affect enzyme activity (experimenting on the effects of the factors ); Applying enzymes in everyday life ( brewing, baking, detergents, tanning leather )."
    },
    {
      "unit": "Maintenance of the Organism",
      "subtopics": [
        "Nutrition: Dentition in Mammals",
        "Holozoic Nutrition",
        "Transport in Animals",
        "Gaseous Exchange and Respiration"
      ],
      "learning_outcomes": "Analyse dentition in mammals by Examining the structure (shape ) and type of teeth in relation to their function; Describing the internal structure and function of a human tooth ( enamel, dentine, pulp cavity, cement, nerve endings, blood capillary ); Studying dental formulae of different mammals ( carnivore, herbivore and omnivore ); Relating dentition of mammals (carnivores, herbivores and omnivores ) to diet; Identifying the causes, signs, symptoms and prevention of gum disease and tooth decay; Devise remedies to address gum diseases and tooth decay. Analyse holozoic nutrition by Describing holozoic nutrition; Explaining the main processes in holozoic nutrition ( ingestion, digestion, absorption, assimilation and egestion ); Relating the main regions of the alimentary canal and associated organs ( liver and pancreas ) to their functions (Refer to the alimentary canal of man ); Describing the processes of digestion, absorption and assimilation of nutrients in the alimentary canal of man(carbohydrates, proteins and lipids ); Drawing the alimentary canal of human beings; Making a model to trace the movements of food materials along the alimentary canal; Examining the internal detailed structure of the small intestines; Analysing the common ailments of the alimentary canal ( dehydration: loss of mineral salts and loss of fluids and inflammation of the alimentary canal, colon cancer, constipation, appendicitis, stomach ulcers ); Describing the metabolic functions of the liver(deamination, detoxification, production of bile, regulation of blood sugar, storage of glycogen, fat soluble vitamins and iron ); Describing the effects of common ailments of the liver (poor bile formation, high blood sugar, low blood sugar and high toxin levels in the blood ); Devising remedies to address ailments of the alimentary canal and the liver. Analyse the composition of blood by Identifying the components of blood ( solid: leucocytes, erythrocytes, thrombocytes; Liquid: plasma ); Identifying the sites where the blood cells are produced ( bone marrow: red blood cells, platelets and white blood cells; lymph nodes, thymus gland and spleen: white blood cells ); Distinguishing between the red and the white blood cells(structural and functional differences ); Investigating common blood disorders ( leukaemia, sickle cell anaemia, iron-deficiency anaemia and haemophilia ). Explore the functions of blood by Analysing the functions of blood ( transport, homeostatic and defense ); Exploring the mechanism of blood clotting ( change of enzyme prothrombin to thrombin, fibrinogen to fibrin and role of calcium ions, vitamin K and thromboplastin ). Demonstrate understanding of ABO blood groups by Describing blood groups ( A, B, AB and O ) in relation to presence or absence of antigens and antibodies; Explaining the importance of determining the blood groups and Rhesus factors ( blood transfusions and transplants; the danger of Rhesus antibodies to the Rhesus positive foetus: haemolytic disease ); Relating the importance of blood screening to blood transfusion; Determining the donor-recipient compatibility of blood groups ( antibody and Antigen reaction when blood of different groups is mixed ). Demonstrate understanding of the structure and function of the human heart by Describing the structure of the human heart ( drawing/model showing chambers, valves, vessels, including coronary arteries ); Comparing and contrasting the structure of the human heart and that of four chambered animals ( cow, goat, sheep, chicken …); Drawing and labeling a longitudinal section of the four chambered heart; Describing the mechanism of the diastole and systole of the cardiac cycle ( include heart beat and pulse ); Investigating the causes of coronary heart disease (lifestyle: diet, stress, smoking, lack of exercise; exposure to air pollutants: carbon monoxide ); Preventing coronary heart diseases ( health diet, regular exercises, stress management, avoid smoking and exposure to air pollutants). Demonstrate understanding of the blood circulatory system by Describing types of blood circulatory systems ( closed: Humans; and open: insects ); Illustrating double circulation (pulmonary and systemic circulation ); Distinguishing between single circulation ( fish e.g. Tilapia ) and double circulation (mammals e.g. humans); Relating the main blood vessels in the double circulatory system to functions (arteries and veins transporting blood to and from major organs: heart, lungs, head, limbs, intestines, liver and kidneys ); Comparing and contrasting the structure and functions of arteries, veins and capillaries(transverse and longitudinal sections ). Demonstrate understanding of the lymphatic system by Describing the structure and functions of the lymphatic system ( structure: lymph vessels, lymph nodes, thymus gland, and spleen; function: defence, transport of materials back into blood circulatory system ); Identifying the structure of lymph vessels ( transverse section only ); Distinguishing the blood circulatory system from the lymphatic system; Explaining the formation of tissue fluid and lymph(capillary pressure ); Comparing and contrasting tissue fluid and lymph to blood(composition and functions ); Evaluating the significance of the lymphatic system. Demonstrate understanding of gaseous exchange and respiration by Describing the respiratory structures in animals ( insects: spiracles, trachea and tracheoles; fish: operculum, mouth, gills; humans: nostrils, trachea, bronchi, bronchioles, alveoli ); Relating the parts of the respiratory structures in animals to their functions; Demonstrating the mechanism of gaseous exchange in animals (inspiration and expiration in an insect, fish and human beings: diffusion of gases in respiratory organs of humans, fish and insects ); Making of models on gaseous exchange in animals; Investigating the composition of inspired and expired air(oxygen, carbon dioxide, nitrogen, water vapour ); Exploring the adverse effects of air pollutants on health of human beings ( nicotine, tar, sulphur dioxide and carbon monoxide ); Describing gaseous exchange in plants ( during day time and night time ); Describing types of tissue respiration ( aerobic and anaerobic respiration ); Comparing and contrasting aerobic and anaerobic respiration; Describing the conversion of adenosine diphosphate to adenosine triphosphate ( word and chemical equations ); Investigating the production of carbon dioxide ( CO 2) during respiration ( experiment to show production of CO 2 during aerobic and anaerobic respiration ); Evaluating the importance of respiration in daily life(production of biological energy, maintenance of levels of carbon dioxide and oxygen in the atmosphere ); Exploring the significance of energy released during respiration ( chemical synthesis of macromolecules, muscle contraction, nerve impulse propagation, iron transport, substrate phosphorylation, cell division, temperature regulation ); Applying respiration in everyday life ( baking, brewing, dairy, sewage treatment )."
    },
    {
      "unit": "Continuity of Life",
      "subtopics": [
        "Reproduction in Amphibians",
        "Fertilisation and Development in Human Beings",
        "Infertility and Birth Control in Humans"
      ],
      "learning_outcomes": "Demonstrate understanding of reproduction in frogs by Investigating the process of reproduction in frogs ( number of eggs laid, nature of fertilisation ); Identifying stages of development and care for the young; Evaluate advantages and disadvantages of the mode of reproduction exhibited in amphibians. Demonstrate understanding of development in human beings by Describing the development process in human beings from conception to adulthood ( Refer to the life cycle ); Analysing the menstrual cycle (stages: follicular growth and ovulation; roles of hormones: FSH, LH, Oestrogen and progesterone ); Explaining the processes of fertilisation ( fusion of sperm and ovum nuclei ) and implantation ( attachment of embryo to uterine wall ) in human beings; Describing development of the embryo in the uterus ( functions of amnion, amniotic fluid, umbilical cord and placenta ); Exploring health risks associated with foetal development ( Poor nutrition, smoking, intake of alcohol, abuse of drugs and herbal medicines during pregnancy ); Describing healthy pregnancy and safe child birth ( antenatal services, good nutrition, exercise, giving birth at a health facility ); Evaluating the advantages and disadvantages of reproduction in human beings (viviparous ). Explore the causes of infertility in human beings by Identifying causes of infertility in human beings (Females: blocked oviducts, ovulation disorders, fibroids, hormonal imbalance, STIs, alcoholism, infections of upper part of uterus due to medical procedures; males: weak sperms, STIs, alcoholism, low sperm count, testicular malfunction, azoospermia ); Investigating ways of addressing challenges of infertility in humans; Demystifying infertility in humans. Evaluate birth control methods in human beings by Describing birth control; Explaining some methods of birth control ( mechanical: condoms, IUDs; surgical: tubal ligation, vasectomy; hormonal: injectable, contraceptive pills and implants; and natural control: rhythm, withdrawal and abstinence ); Evaluating the benefits and possible risks of using contraceptives ( benefits: Planned families; varying risks of individual contraceptive methods )."
    },
    {
      "unit": "Coordination and Response",
      "subtopics": [
        "Immunity",
        "The Endocrine System",
        "The Nervous System"
      ],
      "learning_outcomes": "Relate immunity to disease prevention by Explaining immunity to disease; Categorising immunity (natural: active and passive; artificial: active and passive ); Investigating factors that reduce immunity to pathogenic disease ( poor diet, repeated invasions by pathogens, developing resistance to strains of pathogens, tolerance to drugs ); Recommending factors that improve immunity (adherence to treatment, healthy diet, exercising, immunisations and vaccinations… ); Evaluating the importance of the immune system ( control of diseases ); Demystifying vaccinations and immunisations in the community. Demonstrate understanding of the endocrine system by Describing hormones in humans; Identifying the endocrine glands in human beings and the hormones they produce (pancreas: insulin and glucagon; adrenal gland: adrenaline; thyroid gland: thyroxine; pituitary gland: ADH, TSH, FSH, GH ); Analysing the functions of thyroxine, insulin, glucagon and adrenaline ( effects of over and under secretion of hormones ); Evaluate the importance of endocrine system. Demonstrate understanding of the nervous system by Describing the composition of the nervous system (peripheral nervous system and central nervous system ); Identifying main parts of the nervous system in a human being ( neurones, spinal cord and brain ); Describing neurones (structure and functions of sensory, motor and relay neurons ); Elaborating the path taken by an impulse through a spinal reflex arc ( movement of an impulse through sensory neurone to the CNS and to effectors ); Demonstrating spinal, cranial and the conditioned reflex actions ( spinal reflex: knee jerk, arm flexing ); cranial reflex: blinking, coughing, pupil reflex ) conditioned reflex: Pavlov’s experiment ); Identifying the main parts of the brain of a human being (cerebral hemispheres, cerebellum, hypothalamus, pituitary gland and medulla oblongata); Explaining the functions of the forebrain and the hindbrain ( fore brain: cerebrum, pituitary gland and hypothalamus; and hind brain: cerebellum and medulla oblongata ); Analysing the effects of abuse of drugs on the nervous System ( depressants e.g. alcohol, heroine: increase reaction time; stimulants e.g. cocaine, caffeine, nicotine: increase in motor activity, increased heart rate improved attention; hallucinogens e.g. marijuana: distort judgment ); Explaining the effects of tetanus infection ( damage to brain cells and impairment of nerve tissue ); Comparing and contrasting the endocrine and nervous system."
    },
    {
      "unit": "Ecological Relationships and Evolution",
      "subtopics": [
        "Nutrient Cycles in the Ecosystem",
        "Water Cycle",
        "Levels of Classification"
      ],
      "learning_outcomes": "Explore the cycling of carbon and nitrogen in the biosphere by Describing carbon and nitrogen cycles in the biosphere ( include the roles of micro-organisms ); Designing the Carbon and Nitrogen cycles in the ecosystem; Evaluating the importance of carbon and nitrogen cycles in the ecosystem; Investigating factors that disrupt the carbon and nitrogen cycles. Explore the water cycle by Describing the water cycle; Investigating the factors that affect the water cycle (deforestation, overgrazing, wild fires, temperature ); Evaluating the importance of water in the ecosystem. Classify various types of plants and animals by Identifying various types of plants in the local environment ( chlorophytes, bryophytes, pteridophytes, gymnosperms and angiosperms ); Identifying various types of animals in the local environment ( mammals, reptiles, amphibians, birds, arthropods and protozoa ); Formulating a dichotomous key to classify plants and animals; Using a dichotomous key to identify common plants and animals up to species level (maize, mango, human being, lion)."
    }
  ]
}