{
  "curriculum": "Zambia ECZ",
  "grade": "9",
  "subject": "Biology",
  "topics": [
    {
      "unit": "Concepts and Methods in Biology",
      "subtopics": [
        "Experimental Design",
        "Limits of Science",
        "Scientific Ethics"
      ],
      "learning_outcomes": "Apply experimental design in scientific investigations by Analysing sampling methods; Carrying out investigations using the scientific design. Practising the use of two or more variables when conducting experiments (independent, dependent and control ). Identify the limits of science by Explaining the limits of science ( laws, language, tools, dynamic nature of elements, inconsistence of elements ); Classifying limits of science ( beliefs, natural laws, ecological laws ). Evaluate ethics of scientific research by Determining scientific ethics of a given research ( consent, no discrimination, honesty, confidentiality ); Applying the ethics of scientific research."
    },
    {
      "unit": "Principles of Cellular Life",
      "subtopics": [
        "Micrographs",
        "Staining Specimen and Preparation of Permanent Slides",
        "Detailed Cell Structure",
        "Properties of Water"
      ],
      "learning_outcomes": "Interpret micrographs by Identifying types of micrographs; Explaining micrographs of plant and animal tissues ( Plant: palisade, spongy, epidermal; animal: blood cells, muscle cells, nerve cells ); Interpreting micrographs; Communicating scientific information effectively using micrographs. Apply appropriate staining techniques on specimen by Exploring staining techniques on specimen; Staining of specimen; Preparing permanent plant tissue slides. Illustrate detailed cell structure of an organism by Drawing detailed cell structure; Designing detailed models of cells; Applying knowledge of organelles and their functions in order to understand cellular functions. Analyse the properties of water in relation to supporting life by Investigating properties of water in relation to supporting life ( transparent to light, universal solvent, liquid at room temperature, has neutral pH, surface tension, its density reduces when in solid form, ability to resist temperature changes ); Evaluating importance of water in a cell ( medium of chemical reaction, acts as a solvent, turgidity in plant cells )."
    },
    {
      "unit": "Maintenance of the Organism",
      "subtopics": [
        "Nutrition - Types of Nutrition",
        "Autotrophic Nutrition",
        "Heterotrophic Nutrition",
        "Transport in Plants"
      ],
      "learning_outcomes": "Categorise types of nutrition in living organisms by Describing nutrition ( autotrophic and heterotrophic ); Identifying types of heterotrophic nutrition in organisms in the local environment ( parasitism, saprophytic and holozoic ); Distinguishing autotrophic nutrition from heterotrophic nutrition; Relating nutrition to different organisms found in the environment. Analyse phototrophic nutrition in plants by Examining external and internal structures of a leaf; Explaining the process of photosynthesis in plants ( light and dark reactions ); Tracing the fate of glucose produced by photosynthesis ( glucose , sucrose, starch, proteins, lipids ); Identifying storage organs of the products of photosynthesis ( leaves, root and stem tubers, fruits, seeds ); Investigating factors necessary for the process of photosynthesis in plants; Designing experiments on factors necessary for photosynthesis in plants (carbon dioxide, light energy, chlorophyll ); Relating how the factors that affect photosynthesis improve crop yield; Constructing word and chemical equations for photosynthesis process. Evaluate the importance of photosynthesis to the environment by Explaining the importance of photosynthesis to the environment(economic importance, balance of carbon dioxide and oxygen in the atmosphere, carbon sink… ). Analyse types of heterotrophic nutrition in living organisms by Identifying the different types of heterotrophic nutrition in living organisms ( parasitic, saprophytic, holozoic ); Illustrating types of heterotrophic nutrition in living organisms ( parasitic- ticks; saprophytic-bread mould); holozoic-human beings). Evaluate the importance of heterotrophic nutrition to organisms and the environment by Evaluating the need for heterotrophic nutrition to organisms and the environment ( obtaining of nutrients; preventing accumulation of dead organic matter in the environment: saprophytes bacteria: sewage treatment, biological control of population, nutrient recycling- Rhizobium, dairy products; fungi: source of food, brewing, manufacture of antibiotics, causing diseases… ). Demonstrate understanding of transport system of flowering plants by Describing transport system of flowering plants; Identifying the organs involved in the transport system in flowering plants(root, stem, leaf ); Analysing root systems in monocotyledonous and dicotyledonous plants; Examining the internal structures of dicot and monocot plants ( cross sections of roots and stems of herbaceous and woody plants- vascular bundles ); Examining the longitudinal section of xylem and phloem; Tracing the uptake and movement of mineral salts and water in the xylem; translocation of nutrients in the phloem. Analyse the process of transpiration in plants by Describing the process of transpiration; Investigating factors that affect the rate of transpiration; Examining adaptive features in plants that reduce excess loss of water. Evaluating the significance of transpiration."
    },
    {
      "unit": "Continuity of Life",
      "subtopics": [
        "Reproduction in Plants",
        "Germination, Growth and Development in Plants"
      ],
      "learning_outcomes": "Propagate different plants using asexual reproduction modes by Explaining the different modes of asexual reproduction in plants; Analysing the advantages and disadvantages of vegetative propagation (advantages: increase yields, genetic stability, increased rate in maturity; disadvantages: no genetic variation, plants prone to diseases, overcrowding, undesirable characteristics maintained); Applying different modes of asexual reproduction to propagate different plants (grafting, budding, layering: - vegetative structures, runners, suckers, stems, corms, stem tubers, root tubers, bulbs, rhizomes). Analyse sexual reproduction in flowering plants by Describing sexual reproduction in flowering plants; Collecting flowers from different plant species found in the local environment; Identifying the male parts ( stamen: filament, anther ); and female parts (carpel: stigma, style, ovary, ovules ) of a flower; Observing, drawing and labelling parts of a typical flower; Explaining the functions of the parts of a typical flower ( monocot and dicot flowers ); Describing the process of pollination; Deducing the type of pollination based on the physical features of the flower (cross pollination and self pollination ); Deducing the agents of pollination based on the features of the flower (wind pollinated and insect pollinated ); Illustrating the path taken by a pollen tube leading to double fertilisation of polar nuclei and egg cell. Deduce the methods of seed and fruit dispersal by Collecting different seeds and fruits in the local environment; Comparing and contrasting features of collected seeds and fruits in relation to the method of dispersal; Predicting the method of seed and fruit dispersal based on seed and fruit structure. Explore germination, growth and development in plants by Describing germination in flowering plants; Investigating conditions necessary for germination ( moisture, suitable temperature and oxygen ); Distinguishing hypogeal and epigeal germination in plants; Describing growth and development in plants ( primary and secondary growth ); Examining regions of growth using microscopes, micrographs ( cell division, elongation, and differentiation into phloem and xylem and cambium )."
    },
    {
      "unit": "Coordination and Response",
      "subtopics": [
        "Role of Plant Hormones on Response",
        "Health and Disease"
      ],
      "learning_outcomes": "Demonstrate understanding of the role of auxins in phototropism and geotropism by Describing coordination and response in plants; Investigating the effects of light on plant shoots and roots ( refer to auxins concentrations ); Investigating the effects of gravity on plant shoots and roots. ( Refer to auxin concentrations); Relating the effect of hormones to plant responses. Explore infectious diseases that affect human beings by Describing health and disease; Identifying infectious diseases ( TB, cholera, COVID-19, influenza, HIV and AIDS and STIs…); Categorising infectious diseases (airborne : TB, COVID-19, influenza …; waterborne : cholera, dysentery, typhoid, bilharzia...; foodborne : cholera… ); Exploring the causative agents, signs and symptoms, methods of transmission, prevention and treatment; Dispelling myths and misconceptions of infectious diseases such as TB, AIDS and COVID-19; Evaluating the economic importance of infectious diseases. Explore non infectious diseases that affect human beings by Describing non-infectious diseases; Categorising non-infectious diseases: parasitic (malaria, bilharzia ); genetic (asthma, sickle cell anaemia ); mental illness; dietary diseases (type 2 diabetes, hypertension, hypotension ); Exploring causative agents, signs and symptoms, management and treatment of non-infectious diseases; Investigating life cycles of a housefly and a mosquito ( egg, larva, pupa, adult ); Identifying the role of houseflies and mosquitoes in disease transmission; Relating the control of malaria to the life cycle of the mosquito ( biological and chemical control ); Relating the control of waterborne diseases to the life cycle of a housefly; Devising home-made remedies to eliminate or control causative agents of diseases ( refer to houseflies and mosquitoes ); Evaluating the economic importance of non-infectious diseases."
    },
    {
      "unit": "Ecological Relationships and Evolution",
      "subtopics": [
        "Classification of Organisms",
        "Feeding Relationships and Energy Flow",
        "Pollution"
      ],
      "learning_outcomes": "Classify different organisms into kingdoms by Exploring the local environment to collect different living organisms; Grouping organisms into specific kingdoms-( Archea-bacteria, Eubacteria, Fungi, Protista, Plantae and Animalia ); Analysing characteristics of organisms in each kingdom; Evaluating the importance of classifying organisms. Demonstrate understanding of feeding relationships and energy flow in the ecosystem by Illustrating the flow of energy along food chains and food webs ( ultimate source of energy- the sun, non-cyclical nature of energy flow ); Designing a food chain based on living organisms in the local environment; Designing a food web based on living organisms in the local environment; Distinguishing a food chain from a food web; Predicting effects of a disturbance in food chains and food webs(decrease/increase in population of predators/ prey ….). Analyse the undesirable effects of pollution on the environment by Describing pollution; Categorizing types of pollution ( air, water, land pollution ); Analysing the undesirable effects of pollution on the environment ( Green house effects, global warming leading to climate change, acid rain, eutrophication… ); Recommending appropriate measures to minimise pollution."
    }
  ]
}