{
  "curriculum": "Zambia ECZ",
  "grade": "5",
  "subject": "Mathematics",
  "topics": [
    {
      "unit": "5.1 NUMBERS AND NOTATION",
      "subtopics": [
        "Identify Roman numeration system.",
        "Convert numerals from Arabic to Roman numeration and vice versa.",
        "Order Roman numerals."
      ],
      "learning_outcomes": "Identifying the roman numeration system . Converting Arabic to Roman numeration and vice versa Ordering Roman numerals."
    },
    {
      "unit": "5.2 ADDITION",
      "subtopics": [
        "Add whole numbers using the number line.",
        "Apply addition using the number line to solve problems in real life situations."
      ],
      "learning_outcomes": "Addition on the number line. Addition using the number line to solve problems in real life situations . (To be connected to the addition of integers)"
    },
    {
      "unit": "5.3 SUBTRACTION",
      "subtopics": [
        "Subtract whole numbers using a number line.",
        "Apply subtraction and addition using the number line to solve problems in real life situations."
      ],
      "learning_outcomes": "Subtraction on the number line Subtraction and addition using the number line to solve problems in real life situations (To be connected to the addition of integers)."
    },
    {
      "unit": "5.4 COMBINED OPERATIONS",
      "subtopics": [
        "Perform combined operations",
        "Apply the commutative, associative and distributive laws to four basic mathematical operations."
      ],
      "learning_outcomes": "Combined operations or order of operations – BODMAS (related to real life problems i.e. length, mass, temperature, capacity and time) Applying the commutative, associative and distributive laws to four basic mathematical operations."
    },
    {
      "unit": "5.5 SETS",
      "subtopics": [
        "List all sub sets of a given set.",
        "Describe sets of numbers.",
        "Describe subset in a Venn diagram."
      ],
      "learning_outcomes": "Proper and improper subsets (For sets with up to 4 elements) . Sets of numbers (Natural, Whole, Even, Odd, Prime and Composite) . Subsets in Venn diagrams."
    },
    {
      "unit": "5.6 FACTORS AND MULTIPLES",
      "subtopics": [
        "Identify factors of given numbers",
        "Identify the Highest Common Factor (HCF)",
        "Identify multiples of a given number",
        "Identify the Lowest Common Multiple (LCM) by listing"
      ],
      "learning_outcomes": "Identifying Factors Listing factors of two numbers and Identifying Highest Common Factor (HCF) or Greatest Common Divisor (GCD) Identifying Multiples of a given numbers Listing multiples of two numbers and Identifying Lowest Common Multiple (LCM)."
    },
    {
      "unit": "5.7 FRACTIONS",
      "subtopics": [
        "Identify equivalent fractions by multiplying or dividing the same number with numerator and denominator",
        "Express fractions with different denominators to the same denominator",
        "Add and subtract proper, improper and mixed fractions with different denominators.",
        "Apply knowledge of fractions to solve problems in real life situations"
      ],
      "learning_outcomes": "Identifying equivalent fraction by multiplying or dividing the same number with numerator and denominator Expressing fractions with different denominators to the same denominator Addition and subtraction of fractions with different denominators. Fractions in real life situations"
    },
    {
      "unit": "5.8 DECIMALS",
      "subtopics": [
        "Relate common fractions to decimals.",
        "Describe decimal numbers by their names (up to 2 decimal places)",
        "Add and subtract decimal numbers.",
        "Multiply decimal numbers by whole numbers.",
        "Divide decimal numbers by whole numbers (up to 2 decimal places WITHOUT REMAINDER) .",
        "Apply decimals to solve problems in real life situations ."
      ],
      "learning_outcomes": "Relating common fractions to decimals up to 2 decimal places (i.e. 1/10 = 0.1, 1/100 = 0.01) Understanding the concept of decimals Decimal numbers and their place values (names for 0.1, 0.01 i.e. tenths, hundredths) (note: presentation of decimal numbers on the number line could aid understanding.) Addition and subtraction of decimals numbers up to 2 decimal places Multiplying and division of decimal numbers with one or two digits Decimals in real life situations (e.g. problems involving money-Kwacha and ngwee, temperature and other measures )"
    },
    {
      "unit": "5.9 SOCIAL AND COMMERCIAL ARITHMETIC",
      "subtopics": [
        "Prepare simple household bills (budgeting).",
        "Apply simple ready- reckoners",
        "Read and interpret water and electricity bills."
      ],
      "learning_outcomes": "Budgeting Ready -reckoner Meter reading (water and electricity bills)"
    },
    {
      "unit": "5.10 PLANE SHAPES",
      "subtopics": [
        "Identify and draw perpendicular and parallel lines",
        "Describe trapezium , rhombus and parallelogram",
        "Draw trapezium, rhombus and parallelogram.",
        "Identify the uses of a pair of compasses",
        "Use a pair of compass to draw a circle",
        "Identify centre, diameter and radius of a circle"
      ],
      "learning_outcomes": "Identifying and drawing perpendicular and parallel lines using set squares. Describing trapezium , rhombus and parallelogram Drawing trapezium, rhombus and parallelogram Identifying the uses of a pair of compasses. Using a pair of compass to draw a circle. Identifying centre, diameter and radius of a circle."
    },
    {
      "unit": "5.11 SOLID SHAPES",
      "subtopics": [
        "Identify face, vertex and edges of cuboids and cubes",
        "Draw nets of cuboids and cubes",
        "Draw/sketch cuboid and cube"
      ],
      "learning_outcomes": "Identifying face, vertex and edges on cuboids and cubes (by observing concrete/semi -concrete objects) Number of vertices, edges and faces of cuboid and cubes Describing a net of a cuboid and cube Drawing nets of cuboids and cubes by unfolding them Drawing/sketching cuboid and cube"
    },
    {
      "unit": "5.12 MEASURES",
      "subtopics": [
        "Find the perimeter of triangle, parallelograms, trapezium, rhombus and composite shapes",
        "Derive formula for area of triangle, parallelograms, trapezium and rhombus.",
        "Calculate areas of triangle, parallelograms, trapezium , rhombus and composite shapes",
        "Describe volume",
        "Use standard units to measure volume (cm3, m3)",
        "Relate volume to capacity",
        "Derive the formulae for finding volume",
        "Calculate the volume of cubes and cuboids"
      ],
      "learning_outcomes": "Finding perimeter of triangle, parallelograms, trapezium, rhombus and composite shapes Deriving formulae for area of triangle, parallelograms, trapezium and rhombus Calculating areas of triangle, parallelograms, trapezium, rhombus and composite shapes Describing and using standard units to measure volume (cm3, m3) Relating volume to capacity (cm3, m3, Milliliters, litres) Formulae for finding volume Deriving the formulae for volume (Cube and cuboid) Calculating the volume of cubes and cuboids"
    },
    {
      "unit": "5.13 STATISTICS",
      "subtopics": [
        "Understand stem -leaf plot and on a bar graph.",
        "Collect and present data on a stem -leaf plot and on a bar graph"
      ],
      "learning_outcomes": "Understanding of stem -leaf plot and on a bar graph. Data collection and presentation (on a stem -leaf plot , and on a bar graph)"
    },
    {
      "unit": "5.14 RELATIONS AND MAPPINGS",
      "subtopics": [
        "Illustrate a one -to-many and many -to-one relations",
        "Apply knowledge of relations and mappings in real life situations."
      ],
      "learning_outcomes": "One-to-many and many -to-one relations (involving “is A factor of” , “ is a multiple of ”, etc ) Domain: whole numbers up to    100 000 Relations and mappings."
    }
  ]
}