{
  "curriculum": "Zambia ECZ",
  "grade": "7",
  "subject": "Mathematics",
  "topics": [
    {
      "unit": "7.1 FRACTIONS",
      "subtopics": [
        "Solve problems involving addition, subtraction, multiplication and division of fractions (as recap)"
      ],
      "learning_outcomes": "Addition and subtraction of fractions Multiplication and division of fractions Practical problems involving  four rules on fractions"
    },
    {
      "unit": "7.2 DECIMALS",
      "subtopics": [
        "Solve problems involving addition, subtraction, multiplication and division of decimal (as recap)",
        "Convert common fractions to decimals and vice versa.",
        "Order Fractions and decimals"
      ],
      "learning_outcomes": "Addition, subtraction, multiplication and division of decimals up to 4 decimal places Conversions of fractions to decimals and vice versa Ordering vulgar and decimal fractions (either descending or ascending  order) Using the symbols  (>, < , = ) in comparing fractions"
    },
    {
      "unit": "7.3 PERCENTAGES",
      "subtopics": [
        "Describe a percentage",
        "Convert decimals to percentages and vice versa.",
        "Convert common fractions to percentages and vice versa.",
        "Solve problems involving percentages.",
        "Relate fractions, decimals and percentages to real life situations"
      ],
      "learning_outcomes": "Percentage (as fraction of hundred) Converting decimals to percentages and vice versa Conversion of common fractions to percentages and vice versa Problems involving addition, subtraction, multiplication and division of percentages Fractions, decimals and percentages in  real life"
    },
    {
      "unit": "7.4 RATIO AND PROPORTION",
      "subtopics": [
        "Solve problems involving direct  proportion (as recap)",
        "Describe indirect proportion.",
        "Solve problems involving indirect proportion",
        "Draw graphs to illustrate quantities in direct and indirect proportion."
      ],
      "learning_outcomes": "direct  proportion (as recap) Describing indirect proportion Indirect  proportions using the fraction and proportional methods Drawing g raphs to illustrate quantities in direct and indirect proportion Problems involving ratio and proportion in real life situation"
    },
    {
      "unit": "7.5 SOCIAL & COMMERCIAL ARITHMETIC",
      "subtopics": [
        "Conversion of currencies",
        "Calculate the cost of goods priced in foreign currency."
      ],
      "learning_outcomes": "Buying and selling of foreign currency Conversion of currencies (from local to foreign currency and vice versa)."
    },
    {
      "unit": "7.6 INTEGERS",
      "subtopics": [
        "Understand  integers",
        "Illustrate positive and negative numbers using the number line.",
        "Order integers",
        "Add integers",
        "Subtract integers"
      ],
      "learning_outcomes": "Understanding  positive and negative numbers Relating integers with addition and subtraction of whole numbers using number line. Illustrating positive and negative numbers on the number line Ordering integers Addition of integers using the number line Addition of integers without using the number line Subtraction of integers using the number line Subtraction of integers without using the number line Relating  Integers to  real life situations ( e.g. profit and loss, temperature)"
    },
    {
      "unit": "7.7 NUMBER BASES",
      "subtopics": [
        "Illustrate base t en numeration system",
        "Describe other number bases",
        "Convert from Base 10 to Bases 2, 5 and 8.",
        "Convert from Bases 2 , 5 and 8 to Base 10.",
        "Convert from base 2 to base 5 and vice versa",
        "Add and subtract in Bases 2, 5 and 8."
      ],
      "learning_outcomes": "Base ten n umeration  (place values) Numeration in other bases (2, 5 and 8) Conversion from Base 10 to Bases 2, 5 and 8 and vice versa. Conversion from base 2 to base 5 and vice versa. Addition and subtraction of numbers in Bases 2, 5 and 8"
    },
    {
      "unit": "7.8 NUMBER AND SEQUENCES",
      "subtopics": [
        "Describe perfect squares",
        "Find squares of whole numbers",
        "Describe cubes",
        "Find cubes of whole numbers.",
        "Generate a sequence in a decreasing and increasing order.",
        "Generate series"
      ],
      "learning_outcomes": "Square and squared whole numbers. Cubes and Cubed whole numbers. Triangular whole numbers Identification of sequences. Generating a rule from given sequence and vice versa Generation of series (use ideas such as Fibonacci series)."
    },
    {
      "unit": "7.9 INEQUATIONS",
      "subtopics": [
        "Describe an open sentence",
        "Solve simple linear inequations in one variable."
      ],
      "learning_outcomes": "Open sentences Simple linear in equations in one variable Show the solutions on the number line."
    },
    {
      "unit": "7.10 PLANE SHAPES",
      "subtopics": [
        "Describe line symmetry",
        "Draw lines of symmetry of plane shape.",
        "Establish the relationship between circumference and diameter"
      ],
      "learning_outcomes": "Describing line symmetry through demonstration (paper folding) Completing symmetrical shapes (folded along line of symmetry) Drawing lines  of symmetry of plane shape (e.g. square, rectangle, cir cle) Establishing the  relationship between circumference and diameter (using experiment with cylindrical objects) [constant pi (π = 3.14)]"
    },
    {
      "unit": "7.11 MEASUREMENT",
      "subtopics": [
        "Calculate circumference, using radius or diameter of the circle.",
        "Calculate the area of a circle"
      ],
      "learning_outcomes": "Circumference, using radius or diameter of the circle [constant pi (π = 3.14)] . Establishing the  formula for the area of circle (by demonstration) Calculating the area of a circle [constant pi ( π = 3.14)]"
    },
    {
      "unit": "7.12 SOLID SHAPES",
      "subtopics": [
        "Identify a cylinder and triangular prism",
        "Draw nets of cylinder and triangular prism",
        "Draw/sketch cylinder and triangular prism"
      ],
      "learning_outcomes": "Identifying a cylinder and triangular prism Drawing of  nets of cylinder and triangular prism Draw/sketch cylinder and triangular prism"
    },
    {
      "unit": "7.13 STATISTICS",
      "subtopics": [
        "Interpret data on charts (pie chart, line graph, bar/ line graph, frequency table)",
        "Collect and present data on a pictograph, pie chart, bar chart, line graph and frequency tables.",
        "Calculate Mean , Mode and Median",
        "Calculate averages as applied to mass, money, time, temperature and speed."
      ],
      "learning_outcomes": "Data Interpretation Data collection Data presentation on pictograph, pie chart, bar chart, line graph and  frequency tables presentation Mean, Mode, Median as applied in real life situations Averages as applied to mass, money, time, temperature and speed."
    }
  ]
}